[Killed] BlockStatement
utils/helpers/object/object.helpers.ts:35:84
   return result as T;
 }
 
-function toKebabCaseKeys(object: Record<string, unknown>): Record<string, unknown> {
-  const entries = Object.entries(object).map(([key, value]: [string, unknown]): [string, unknown] => [dash(key), value]);
-
-  return Object.fromEntries(entries);
-}
+function toKebabCaseKeys(object: Record<string, unknown>): Record<string, unknown> {}
 
 export {
killedBy: Object Helpers toKebabCaseKeys should convert keys correctly when undefined
statusReason: expected undefined to strictly equal { Object (cognitive-difficulty, some-key) }
