[Killed] BlockStatement
repositories/goat-it-api/question-themes/question-themes.repository.ts:13:83
 };
 
 export const questionThemesRepository: QuestionThemesRepository = (fetch: $Fetch) => ({
-  async getAll(query?: AdminFindQuestionThemesQueryDto): Promise<QuestionTheme[]> {
-    return fetch<QuestionTheme[]>("/api/goat-it-api/question-themes", { query });
-  },
+  async getAll(query?: AdminFindQuestionThemesQueryDto): Promise<QuestionTheme[]> {},
 
   async getById(id: string): Promise<QuestionTheme> {
killedBy: questionThemesRepository2 getAll should call fetch with the correct endpoint and undefined query when called without params.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
repositories/goat-it-api/question-themes/question-themes.repository.ts:17:53
     return fetch<QuestionTheme[]>("/api/goat-it-api/question-themes", { query });
   },
 
-  async getById(id: string): Promise<QuestionTheme> {
-    return fetch<QuestionTheme>(`/api/goat-it-api/question-themes/${id}`);
-  },
+  async getById(id: string): Promise<QuestionTheme> {},
 
   async create(creationDto: QuestionThemeCreationDto): Promise<QuestionTheme> {
killedBy: questionThemesRepository2 getById should call fetch with the correct endpoint when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
repositories/goat-it-api/question-themes/question-themes.repository.ts:18:33
   },
 
   async getById(id: string): Promise<QuestionTheme> {
-    return fetch<QuestionTheme>(`/api/goat-it-api/question-themes/${id}`);
+    return fetch<QuestionTheme>(``);
   },
 
killedBy: questionThemesRepository2 getById should call fetch with the correct endpoint when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/goat-it-api/question-themes/fake-id-123",

[Killed] BlockStatement
repositories/goat-it-api/question-themes/question-themes.repository.ts:21:79
     return fetch<QuestionTheme>(`/api/goat-it-api/question-themes/${id}`);
   },
 
-  async create(creationDto: QuestionThemeCreationDto): Promise<QuestionTheme> {
-    return fetch<QuestionTheme>("/api/goat-it-api/question-themes", {
-      method: "POST",
-      body: creationDto,
-    });
-  },
+  async create(creationDto: QuestionThemeCreationDto): Promise<QuestionTheme> {},
 
   async patch(id: string, modificationDto: QuestionThemeModificationDto): Promise<QuestionTheme> {
killedBy: questionThemesRepository2 create should call fetch with the correct endpoint and body when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
repositories/goat-it-api/question-themes/question-themes.repository.ts:28:98
     });
   },
 
-  async patch(id: string, modificationDto: QuestionThemeModificationDto): Promise<QuestionTheme> {
-    return fetch<QuestionTheme>(`/api/goat-it-api/question-themes/${id}`, {
-      method: "PATCH",
-      body: modificationDto,
-    });
-  },
+  async patch(id: string, modificationDto: QuestionThemeModificationDto): Promise<QuestionTheme> {},
 
   async archive(id: string): Promise<QuestionTheme> {
killedBy: questionThemesRepository2 patch should call fetch with the correct endpoint and body when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
repositories/goat-it-api/question-themes/question-themes.repository.ts:35:53
     });
   },
 
-  async archive(id: string): Promise<QuestionTheme> {
-    return fetch<QuestionTheme>(`/api/goat-it-api/question-themes/${id}/archive`, { method: "POST" });
-  },
+  async archive(id: string): Promise<QuestionTheme> {},
 });
 
killedBy: questionThemesRepository2 archive should call fetch with the correct endpoint when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
repositories/goat-it-api/question-themes/question-themes.repository.ts:36:33
   },
 
   async archive(id: string): Promise<QuestionTheme> {
-    return fetch<QuestionTheme>(`/api/goat-it-api/question-themes/${id}/archive`, { method: "POST" });
+    return fetch<QuestionTheme>(``, { method: "POST" });
   },
 });
killedBy: questionThemesRepository2 archive should call fetch with the correct endpoint when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "/api/goat-it-api/question-themes/fake-id-789/archive",
