[Killed] BlockStatement
repositories/goat-it-api/questions/questions.repository.ts:24:73
 };
 
 export const questionsRepository: QuestionsRepository = (fetch: $Fetch) => ({
-  async getAll(query?: AdminFindQuestionsQueryDto): Promise<Question[]> {
-    return fetch<Question[]>("/api/goat-it-api/questions", { query });
-  },
+  async getAll(query?: AdminFindQuestionsQueryDto): Promise<Question[]> {},
 
   async getById(id: string): Promise<Question> {
killedBy: questionsRepository2 getAll should call fetch with the correct endpoint and undefined query when called without params.
statusReason: expected "vi.fn()" to be called once with arguments: [ '/api/goat-it-api/questions', …(1) ]

Number of calls: 0

[Killed] BlockStatement
repositories/goat-it-api/questions/questions.repository.ts:28:48
     return fetch<Question[]>("/api/goat-it-api/questions", { query });
   },
 
-  async getById(id: string): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}`);
-  },
+  async getById(id: string): Promise<Question> {},
 
   async create(creationDto: QuestionCreationDto): Promise<Question> {
killedBy: questionsRepository2 getById should call fetch with correct endpoint when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '/api/goat-it-api/questions/123' ]

Number of calls: 0

[Killed] StringLiteral
repositories/goat-it-api/questions/questions.repository.ts:29:28
   },
 
   async getById(id: string): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}`);
+    return fetch<Question>(``);
   },
 
killedBy: questionsRepository2 getById should call fetch with correct endpoint when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '/api/goat-it-api/questions/123' ]

Received:

  1st vi.fn() call:

  [
-   "/api/goat-it-api/questions/123",

[Killed] BlockStatement
repositories/goat-it-api/questions/questions.repository.ts:32:69
     return fetch<Question>(`/api/goat-it-api/questions/${id}`);
   },
 
-  async create(creationDto: QuestionCreationDto): Promise<Question> {
-    return fetch<Question>("/api/goat-it-api/questions", { method: "POST", body: creationDto });
-  },
+  async create(creationDto: QuestionCreationDto): Promise<Question> {},
 
   async archive(id: string): Promise<Question> {
killedBy: questionsRepository2 create should call fetch with correct endpoint and body when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '/api/goat-it-api/questions', …(1) ]

Number of calls: 0

[Killed] StringLiteral
repositories/goat-it-api/questions/questions.repository.ts:33:68
   },
 
   async create(creationDto: QuestionCreationDto): Promise<Question> {
-    return fetch<Question>("/api/goat-it-api/questions", { method: "POST", body: creationDto });
+    return fetch<Question>("/api/goat-it-api/questions", { method: "", body: creationDto });
   },
 
killedBy: questionsRepository2 create should call fetch with correct endpoint and body when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '/api/goat-it-api/questions', …(1) ]

Received:

  1st vi.fn() call:

@@ -37,8 +37,8 @@
            "isPrimary": true,

[Killed] ObjectLiteral
repositories/goat-it-api/questions/questions.repository.ts:33:58
   },
 
   async create(creationDto: QuestionCreationDto): Promise<Question> {
-    return fetch<Question>("/api/goat-it-api/questions", { method: "POST", body: creationDto });
+    return fetch<Question>("/api/goat-it-api/questions", {});
   },
 
killedBy: questionsRepository2 create should call fetch with correct endpoint and body when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '/api/goat-it-api/questions', …(1) ]

Received:

  1st vi.fn() call:

  [
    "/api/goat-it-api/questions",

[Killed] BlockStatement
repositories/goat-it-api/questions/questions.repository.ts:36:48
     return fetch<Question>("/api/goat-it-api/questions", { method: "POST", body: creationDto });
   },
 
-  async archive(id: string): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}/archive`, { method: "POST" });
-  },
+  async archive(id: string): Promise<Question> {},
 
   async assignTheme(id: string, dto: QuestionThemeAssignmentCreationDto): Promise<Question> {
killedBy: questionsRepository2 archive should call fetch with correct endpoint when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
repositories/goat-it-api/questions/questions.repository.ts:37:28
   },
 
   async archive(id: string): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}/archive`, { method: "POST" });
+    return fetch<Question>(``, { method: "POST" });
   },
 
killedBy: questionsRepository2 archive should call fetch with correct endpoint when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "/api/goat-it-api/questions/123/archive",

[Killed] BlockStatement
repositories/goat-it-api/questions/questions.repository.ts:40:93
     return fetch<Question>(`/api/goat-it-api/questions/${id}/archive`, { method: "POST" });
   },
 
-  async assignTheme(id: string, dto: QuestionThemeAssignmentCreationDto): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}/themes`, { method: "POST", body: dto });
-  },
+  async assignTheme(id: string, dto: QuestionThemeAssignmentCreationDto): Promise<Question> {},
 
   async removeTheme(id: string, themeId: string): Promise<Question> {
killedBy: questionsRepository2 assignTheme should call fetch with correct endpoint and body when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
repositories/goat-it-api/questions/questions.repository.ts:41:28
   },
 
   async assignTheme(id: string, dto: QuestionThemeAssignmentCreationDto): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}/themes`, { method: "POST", body: dto });
+    return fetch<Question>(``, { method: "POST", body: dto });
   },
 
killedBy: questionsRepository2 assignTheme should call fetch with correct endpoint and body when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] BlockStatement
repositories/goat-it-api/questions/questions.repository.ts:44:69
     return fetch<Question>(`/api/goat-it-api/questions/${id}/themes`, { method: "POST", body: dto });
   },
 
-  async removeTheme(id: string, themeId: string): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}/themes/${themeId}`, { method: "DELETE" });
-  },
+  async removeTheme(id: string, themeId: string): Promise<Question> {},
 
   async modifyThemeAssignment(id: string, themeId: string, dto: QuestionThemeAssignmentModificationDto): Promise<Question> {
killedBy: questionsRepository2 removeTheme should call fetch with correct endpoint when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
repositories/goat-it-api/questions/questions.repository.ts:45:92
   },
 
   async removeTheme(id: string, themeId: string): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}/themes/${themeId}`, { method: "DELETE" });
+    return fetch<Question>(`/api/goat-it-api/questions/${id}/themes/${themeId}`, { method: "" });
   },
 
killedBy: questionsRepository2 removeTheme should call fetch with correct endpoint when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "/api/goat-it-api/questions/123/themes/456",

[Killed] StringLiteral
repositories/goat-it-api/questions/questions.repository.ts:45:28
   },
 
   async removeTheme(id: string, themeId: string): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}/themes/${themeId}`, { method: "DELETE" });
+    return fetch<Question>(``, { method: "DELETE" });
   },
 
killedBy: questionsRepository2 removeTheme should call fetch with correct endpoint when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "/api/goat-it-api/questions/123/themes/456",

[Killed] BlockStatement
repositories/goat-it-api/questions/questions.repository.ts:48:124
     return fetch<Question>(`/api/goat-it-api/questions/${id}/themes/${themeId}`, { method: "DELETE" });
   },
 
-  async modifyThemeAssignment(id: string, themeId: string, dto: QuestionThemeAssignmentModificationDto): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}/themes/${themeId}`, { method: "PATCH", body: dto });
-  },
+  async modifyThemeAssignment(id: string, themeId: string, dto: QuestionThemeAssignmentModificationDto): Promise<Question> {},
 
   async modify(id: string, dto: QuestionModificationDto): Promise<Question> {
killedBy: questionsRepository2 modifyThemeAssignment should call fetch with correct endpoint and body when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
repositories/goat-it-api/questions/questions.repository.ts:49:28
   },
 
   async modifyThemeAssignment(id: string, themeId: string, dto: QuestionThemeAssignmentModificationDto): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}/themes/${themeId}`, { method: "PATCH", body: dto });
+    return fetch<Question>(``, { method: "PATCH", body: dto });
   },
 
killedBy: questionsRepository2 modifyThemeAssignment should call fetch with correct endpoint and body when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] BlockStatement
repositories/goat-it-api/questions/questions.repository.ts:52:77
     return fetch<Question>(`/api/goat-it-api/questions/${id}/themes/${themeId}`, { method: "PATCH", body: dto });
   },
 
-  async modify(id: string, dto: QuestionModificationDto): Promise<Question> {
-    return fetch<Question>(`/api/goat-it-api/questions/${id}`, { method: "PATCH", body: dto });
-  },
+  async modify(id: string, dto: QuestionModificationDto): Promise<Question> {},
 });
 
killedBy: questionsRepository2 modify should call fetch with correct endpoint and body when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Number of calls: 0
