[Killed] BlockStatement
localization/helpers/shell/localization.shell.helpers.ts:6:59
 
 import type { Shell } from "#shared/types/object.types";
 
-function createLocalizedTextShell(): Shell<LocalizedText> {
-  return LOCALES.reduce((agg, locale) => {
-    agg[locale] = undefined;
-
-    return agg;
-    // Acceptable as we are sure that LOCALES are key of LocalizedText
-    // oxlint-disable-next-line typescript/no-unsafe-type-assertion
-  }, {} as Shell<LocalizedText>);
-}
+function createLocalizedTextShell(): Shell<LocalizedText> {}
 
 function createLocalizedTextsShell(): Shell<LocalizedTexts> {
killedBy: createQuestionCreationDtoShell should return a localized text shell when content field is undefined
statusReason: expected undefined to strictly equal { en: undefined, fr: undefined, …(4) }

[Killed] BlockStatement
localization/helpers/shell/localization.shell.helpers.ts:7:42
 import type { Shell } from "#shared/types/object.types";
 
 function createLocalizedTextShell(): Shell<LocalizedText> {
-  return LOCALES.reduce((agg, locale) => {
-    agg[locale] = undefined;
-
-    return agg;
-    // Acceptable as we are sure that LOCALES are key of LocalizedText
-    // oxlint-disable-next-line typescript/no-unsafe-type-assertion
-  }, {} as Shell<LocalizedText>);
+  return LOCALES.reduce((agg, locale) => {}, {} as Shell<LocalizedText>);
 }
 
killedBy: createQuestionCreationDtoShell should return a localized text shell when content field is undefined
statusReason: expected undefined to strictly equal { en: undefined, fr: undefined, …(4) }

[Killed] BlockStatement
localization/helpers/shell/localization.shell.helpers.ts:16:61
   }, {} as Shell<LocalizedText>);
 }
 
-function createLocalizedTextsShell(): Shell<LocalizedTexts> {
-  return LOCALES.reduce((agg, locale: keyof LocalizedTexts) => {
-    agg[locale] = undefined;
-
-    return agg;
-    // Acceptable as we are sure that LOCALES are key of LocalizedTexts
-    // oxlint-disable-next-line typescript/no-unsafe-type-assertion
-  }, {} as Shell<LocalizedTexts>);
-}
+function createLocalizedTextsShell(): Shell<LocalizedTexts> {}
 
 export {
killedBy: createQuestionCreationDtoShell should return a localized text shell when content field is undefined
statusReason: expected undefined to strictly equal { en: undefined, fr: undefined, …(4) }

[Killed] BlockStatement
localization/helpers/shell/localization.shell.helpers.ts:17:64
 }
 
 function createLocalizedTextsShell(): Shell<LocalizedTexts> {
-  return LOCALES.reduce((agg, locale: keyof LocalizedTexts) => {
-    agg[locale] = undefined;
-
-    return agg;
-    // Acceptable as we are sure that LOCALES are key of LocalizedTexts
-    // oxlint-disable-next-line typescript/no-unsafe-type-assertion
-  }, {} as Shell<LocalizedTexts>);
+  return LOCALES.reduce((agg, locale: keyof LocalizedTexts) => {}, {} as Shell<LocalizedTexts>);
 }
 
killedBy: createQuestionCreationDtoShell should return a localized text shell when content field is undefined
statusReason: expected undefined to strictly equal { en: undefined, fr: undefined, …(4) }
