[Killed] BlockStatement
core/localization/use-localized-value/useLocalizedValue.ts:6:96
 import type { UseLocalizedValue } from "~/composables/core/localization/use-localized-value/use-localized-value.types";
 import { isLocalizedValueMissing, getLocalizedDisplayValue } from "#shared/utils/helpers/localization/localization.helpers";
 
-function useLocalizedValue(localizedText: MaybeRef<Partial<LocalizedText>>): UseLocalizedValue {
-  const { locale: currentLocale } = useI18n();
-
-  const isCurrentLocaleMissing = computed<boolean>(() => isLocalizedValueMissing(toValue(localizedText), currentLocale.value));
-
-  const currentLocaleDisplayValue = computed<string | undefined>(() => getLocalizedDisplayValue(toValue(localizedText), currentLocale.value));
-
-  return { isCurrentLocaleMissing, currentLocaleDisplayValue };
-}
+function useLocalizedValue(localizedText: MaybeRef<Partial<LocalizedText>>): UseLocalizedValue {}
 
 export { useLocalizedValue };
killedBy: useLocalizedValue Composable isCurrentLocaleMissing should return true when current locale value is undefined.
statusReason: Cannot destructure property 'isCurrentLocaleMissing' of 'useLocalizedValue(...)' as it is undefined.

[Killed] ArrowFunction
core/localization/use-localized-value/useLocalizedValue.ts:9:52
 function useLocalizedValue(localizedText: MaybeRef<Partial<LocalizedText>>): UseLocalizedValue {
   const { locale: currentLocale } = useI18n();
 
-  const isCurrentLocaleMissing = computed<boolean>(() => isLocalizedValueMissing(toValue(localizedText), currentLocale.value));
+  const isCurrentLocaleMissing = computed<boolean>(() => undefined);
 
   const currentLocaleDisplayValue = computed<string | undefined>(() => getLocalizedDisplayValue(toValue(localizedText), currentLocale.value));
killedBy: useLocalizedValue Composable isCurrentLocaleMissing should return true when current locale value is undefined.
statusReason: expected undefined to be truthy

[Killed] ArrowFunction
core/localization/use-localized-value/useLocalizedValue.ts:11:66
 
   const isCurrentLocaleMissing = computed<boolean>(() => isLocalizedValueMissing(toValue(localizedText), currentLocale.value));
 
-  const currentLocaleDisplayValue = computed<string | undefined>(() => getLocalizedDisplayValue(toValue(localizedText), currentLocale.value));
+  const currentLocaleDisplayValue = computed<string | undefined>(() => undefined);
 
   return { isCurrentLocaleMissing, currentLocaleDisplayValue };
killedBy: useLocalizedValue Composable currentLocaleDisplayValue should return trimmed string when current locale value is available.
statusReason: expected undefined to be 'Hello' // Object.is equality
