[Killed] BlockStatement
core/localization/use-translation-completeness/useTranslationCompleteness.ts:7:145
 import type { UseTranslationCompleteness } from "~/composables/core/localization/use-translation-completeness/use-translation-completeness.types";
 import { isLocalizedValueMissing } from "#shared/utils/helpers/localization/localization.helpers";
 
-function useTranslationCompleteness(requiredFields: MaybeRef<(Partial<LocalizedText> | Partial<LocalizedTexts>)[]>): UseTranslationCompleteness {
-  const totalCount = LOCALES.length;
-
-  const localeStatuses = computed<Record<Locale, boolean>>(() => {
-    const fields = toValue(requiredFields);
-
-    // Acceptable as LOCALES guarantees all Locale keys will be populated
-    // oxlint-disable-next-line typescript/no-unsafe-type-assertion
-    return Object.fromEntries(LOCALES.map(locale => [locale, fields.every(field => !isLocalizedValueMissing(field, locale))])) as Record<Locale, boolean>;
-  });
-
-  const completedCount = computed<number>(() => Object.values(localeStatuses.value).filter(Boolean).length);
-
-  const isFullyTranslated = computed<boolean>(() => completedCount.value === totalCount);
-
-  function isLocaleComplete(locale: Locale): boolean {
-    return localeStatuses.value[locale];
-  }
-  return { completedCount, totalCount, localeStatuses, isFullyTranslated, isLocaleComplete };
-}
+function useTranslationCompleteness(requiredFields: MaybeRef<(Partial<LocalizedText> | Partial<LocalizedTexts>)[]>): UseTranslationCompleteness {}
 
 export { useTranslationCompleteness };
killedBy: useTranslationCompleteness completedCount should return 6 when all locales have non-empty values in all fields.
statusReason: Cannot destructure property 'completedCount' of 'useTranslationCompleteness(...)' as it is undefined.

[Killed] BlockStatement
core/localization/use-translation-completeness/useTranslationCompleteness.ts:10:66
 function useTranslationCompleteness(requiredFields: MaybeRef<(Partial<LocalizedText> | Partial<LocalizedTexts>)[]>): UseTranslationCompleteness {
   const totalCount = LOCALES.length;
 
-  const localeStatuses = computed<Record<Locale, boolean>>(() => {
-    const fields = toValue(requiredFields);
-
-    // Acceptable as LOCALES guarantees all Locale keys will be populated
-    // oxlint-disable-next-line typescript/no-unsafe-type-assertion
-    return Object.fromEntries(LOCALES.map(locale => [locale, fields.every(field => !isLocalizedValueMissing(field, locale))])) as Record<Locale, boolean>;
-  });
+  const localeStatuses = computed<Record<Locale, boolean>>(() => {});
 
   const completedCount = computed<number>(() => Object.values(localeStatuses.value).filter(Boolean).length);
killedBy: useTranslationCompleteness completedCount should return 6 when all locales have non-empty values in all fields.
statusReason: Cannot convert undefined or null to object

[Killed] MethodExpression
core/localization/use-translation-completeness/useTranslationCompleteness.ts:18:49
     return Object.fromEntries(LOCALES.map(locale => [locale, fields.every(field => !isLocalizedValueMissing(field, locale))])) as Record<Locale, boolean>;
   });
 
-  const completedCount = computed<number>(() => Object.values(localeStatuses.value).filter(Boolean).length);
+  const completedCount = computed<number>(() => Object.values(localeStatuses.value).length);
 
   const isFullyTranslated = computed<boolean>(() => completedCount.value === totalCount);
killedBy: useTranslationCompleteness completedCount should return 0 when all locales are empty in all fields.
statusReason: expected 6 to be +0 // Object.is equality

[Killed] ArrowFunction
core/localization/use-translation-completeness/useTranslationCompleteness.ts:18:43
     return Object.fromEntries(LOCALES.map(locale => [locale, fields.every(field => !isLocalizedValueMissing(field, locale))])) as Record<Locale, boolean>;
   });
 
-  const completedCount = computed<number>(() => Object.values(localeStatuses.value).filter(Boolean).length);
+  const completedCount = computed<number>(() => undefined);
 
   const isFullyTranslated = computed<boolean>(() => completedCount.value === totalCount);
killedBy: useTranslationCompleteness completedCount should return 6 when all locales have non-empty values in all fields.
statusReason: expected undefined to be 6 // Object.is equality

[Killed] ConditionalExpression
core/localization/use-translation-completeness/useTranslationCompleteness.ts:20:53
 
   const completedCount = computed<number>(() => Object.values(localeStatuses.value).filter(Boolean).length);
 
-  const isFullyTranslated = computed<boolean>(() => completedCount.value === totalCount);
+  const isFullyTranslated = computed<boolean>(() => true);
 
   function isLocaleComplete(locale: Locale): boolean {
killedBy: useTranslationCompleteness isFullyTranslated should return false when some locales are empty.
statusReason: expected true to be falsy

[Killed] EqualityOperator
core/localization/use-translation-completeness/useTranslationCompleteness.ts:20:53
 
   const completedCount = computed<number>(() => Object.values(localeStatuses.value).filter(Boolean).length);
 
-  const isFullyTranslated = computed<boolean>(() => completedCount.value === totalCount);
+  const isFullyTranslated = computed<boolean>(() => completedCount.value !== totalCount);
 
   function isLocaleComplete(locale: Locale): boolean {
killedBy: useTranslationCompleteness isFullyTranslated should return true when all locales are filled.
statusReason: expected false to be truthy

[Killed] BlockStatement
core/localization/use-translation-completeness/useTranslationCompleteness.ts:22:54
 
   const isFullyTranslated = computed<boolean>(() => completedCount.value === totalCount);
 
-  function isLocaleComplete(locale: Locale): boolean {
-    return localeStatuses.value[locale];
-  }
+  function isLocaleComplete(locale: Locale): boolean {}
   return { completedCount, totalCount, localeStatuses, isFullyTranslated, isLocaleComplete };
 }
killedBy: useTranslationCompleteness isLocaleComplete should return true when locale has a non-empty value in all fields.
statusReason: expected undefined to be truthy
