[Killed] BlockStatement
composables/core/useAsyncAction/useAsyncAction.ts:34:83
     setFetchStatusToError,
   } = useFetchStatus();
 
-  async function execute(...arguments_: TArguments): Promise<TResult | undefined> {
-    setFetchStatusToPending();
-    try {
-      const result = await action(...arguments_);
-      setFetchStatusToSuccess();
-
-      return result;
-    } catch(error: unknown) {
-      setFetchStatusToError();
-      onError(error);
-    }
-    return undefined;
-  }
+  async function execute(...arguments_: TArguments): Promise<TResult | undefined> {}
   return {
     execute,
killedBy: useAsyncAction execute should call setFetchStatusToPending when called.
statusReason: expected "vi.fn()" to be called once with arguments: []

Number of calls: 0

[Killed] BlockStatement
composables/core/useAsyncAction/useAsyncAction.ts:36:9
 
   async function execute(...arguments_: TArguments): Promise<TResult | undefined> {
     setFetchStatusToPending();
-    try {
-      const result = await action(...arguments_);
-      setFetchStatusToSuccess();
-
-      return result;
-    } catch(error: unknown) {
+    try {} catch(error: unknown) {
       setFetchStatusToError();
       onError(error);
killedBy: useAsyncAction execute should call the action with provided arguments when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ 42, 'hello' ]

Number of calls: 0

[Killed] BlockStatement
composables/core/useAsyncAction/useAsyncAction.ts:41:29
       setFetchStatusToSuccess();
 
       return result;
-    } catch(error: unknown) {
-      setFetchStatusToError();
-      onError(error);
-    }
+    } catch(error: unknown) {}
     return undefined;
   }
killedBy: useAsyncAction execute should call setFetchStatusToError when action rejects.
statusReason: expected "vi.fn()" to be called once with arguments: []

Number of calls: 0
