[Killed] StringLiteral
composables/core/useFetchStatus/useFetchStatus.ts:15:51
 };
 
 function useFetchStatus(): UseFetchStatus {
-  const fetchStatus = ref<AsyncDataRequestStatus>("idle");
+  const fetchStatus = ref<AsyncDataRequestStatus>("");
 
   const isIdle = computed<boolean>(() => fetchStatus.value === "idle");
killedBy: useFetchStatus fetchStatus should have idle status when initialized.
statusReason: expected '' to be 'idle' // Object.is equality

[Killed] ArrowFunction
composables/core/useFetchStatus/useFetchStatus.ts:17:36
 function useFetchStatus(): UseFetchStatus {
   const fetchStatus = ref<AsyncDataRequestStatus>("idle");
 
-  const isIdle = computed<boolean>(() => fetchStatus.value === "idle");
+  const isIdle = computed<boolean>(() => undefined);
   const isPending = computed<boolean>(() => fetchStatus.value === "pending");
   const isSuccess = computed<boolean>(() => fetchStatus.value === "success");
killedBy: useFetchStatus isIdle should be true when status is idle.
statusReason: expected undefined to be truthy

[Killed] EqualityOperator
composables/core/useFetchStatus/useFetchStatus.ts:17:42
 function useFetchStatus(): UseFetchStatus {
   const fetchStatus = ref<AsyncDataRequestStatus>("idle");
 
-  const isIdle = computed<boolean>(() => fetchStatus.value === "idle");
+  const isIdle = computed<boolean>(() => fetchStatus.value !== "idle");
   const isPending = computed<boolean>(() => fetchStatus.value === "pending");
   const isSuccess = computed<boolean>(() => fetchStatus.value === "success");
killedBy: useFetchStatus isIdle should be true when status is idle.
statusReason: expected false to be truthy

[Killed] ConditionalExpression
composables/core/useFetchStatus/useFetchStatus.ts:18:45
   const fetchStatus = ref<AsyncDataRequestStatus>("idle");
 
   const isIdle = computed<boolean>(() => fetchStatus.value === "idle");
-  const isPending = computed<boolean>(() => fetchStatus.value === "pending");
+  const isPending = computed<boolean>(() => false);
   const isSuccess = computed<boolean>(() => fetchStatus.value === "success");
   const isError = computed<boolean>(() => fetchStatus.value === "error");
killedBy: useFetchStatus isPending should be true when status is pending.
statusReason: expected false to be truthy

[Killed] ConditionalExpression
composables/core/useFetchStatus/useFetchStatus.ts:18:45
   const fetchStatus = ref<AsyncDataRequestStatus>("idle");
 
   const isIdle = computed<boolean>(() => fetchStatus.value === "idle");
-  const isPending = computed<boolean>(() => fetchStatus.value === "pending");
+  const isPending = computed<boolean>(() => true);
   const isSuccess = computed<boolean>(() => fetchStatus.value === "success");
   const isError = computed<boolean>(() => fetchStatus.value === "error");
killedBy: useFetchStatus isPending should be false when status is idle.
statusReason: expected true to be falsy

[Killed] ConditionalExpression
composables/core/useFetchStatus/useFetchStatus.ts:19:45
 
   const isIdle = computed<boolean>(() => fetchStatus.value === "idle");
   const isPending = computed<boolean>(() => fetchStatus.value === "pending");
-  const isSuccess = computed<boolean>(() => fetchStatus.value === "success");
+  const isSuccess = computed<boolean>(() => false);
   const isError = computed<boolean>(() => fetchStatus.value === "error");
 
killedBy: useFetchStatus isSuccess should be true when status is success.
statusReason: expected false to be truthy

[Killed] EqualityOperator
composables/core/useFetchStatus/useFetchStatus.ts:19:45
 
   const isIdle = computed<boolean>(() => fetchStatus.value === "idle");
   const isPending = computed<boolean>(() => fetchStatus.value === "pending");
-  const isSuccess = computed<boolean>(() => fetchStatus.value === "success");
+  const isSuccess = computed<boolean>(() => fetchStatus.value !== "success");
   const isError = computed<boolean>(() => fetchStatus.value === "error");
 
killedBy: useFetchStatus isSuccess should be false when status is idle.
statusReason: expected true to be falsy

[Killed] ConditionalExpression
composables/core/useFetchStatus/useFetchStatus.ts:20:43
   const isIdle = computed<boolean>(() => fetchStatus.value === "idle");
   const isPending = computed<boolean>(() => fetchStatus.value === "pending");
   const isSuccess = computed<boolean>(() => fetchStatus.value === "success");
-  const isError = computed<boolean>(() => fetchStatus.value === "error");
+  const isError = computed<boolean>(() => true);
 
   function setFetchStatusToPending(): void {
killedBy: useFetchStatus isError should be false when status is idle.
statusReason: expected true to be falsy

[Killed] ArrowFunction
composables/core/useFetchStatus/useFetchStatus.ts:20:37
   const isIdle = computed<boolean>(() => fetchStatus.value === "idle");
   const isPending = computed<boolean>(() => fetchStatus.value === "pending");
   const isSuccess = computed<boolean>(() => fetchStatus.value === "success");
-  const isError = computed<boolean>(() => fetchStatus.value === "error");
+  const isError = computed<boolean>(() => undefined);
 
   function setFetchStatusToPending(): void {
killedBy: useFetchStatus isError should be true when status is error.
statusReason: expected undefined to be truthy

[Killed] BlockStatement
composables/core/useFetchStatus/useFetchStatus.ts:22:44
   const isSuccess = computed<boolean>(() => fetchStatus.value === "success");
   const isError = computed<boolean>(() => fetchStatus.value === "error");
 
-  function setFetchStatusToPending(): void {
-    fetchStatus.value = "pending";
-  }
+  function setFetchStatusToPending(): void {}
 
   function setFetchStatusToSuccess(): void {
killedBy: useFetchStatus isIdle should be false when status is pending.
statusReason: expected true to be falsy

[Killed] BlockStatement
composables/core/useFetchStatus/useFetchStatus.ts:26:44
     fetchStatus.value = "pending";
   }
 
-  function setFetchStatusToSuccess(): void {
-    fetchStatus.value = "success";
-  }
+  function setFetchStatusToSuccess(): void {}
 
   function setFetchStatusToError(): void {
killedBy: useFetchStatus isIdle should be false when status is success.
statusReason: expected true to be falsy

[Killed] BlockStatement
composables/core/useFetchStatus/useFetchStatus.ts:30:42
     fetchStatus.value = "success";
   }
 
-  function setFetchStatusToError(): void {
-    fetchStatus.value = "error";
-  }
+  function setFetchStatusToError(): void {}
   return {
     fetchStatus,
killedBy: useFetchStatus isIdle should be false when status is error.
statusReason: expected true to be falsy

[Killed] ObjectLiteral
composables/core/useFetchStatus/useFetchStatus.ts:33:10
   function setFetchStatusToError(): void {
     fetchStatus.value = "error";
   }
-  return {
-    fetchStatus,
-    isIdle,
-    isPending,
-    isSuccess,
-    isError,
-    setFetchStatusToPending,
-    setFetchStatusToSuccess,
-    setFetchStatusToError,
-  };
+  return {};
 }
 
killedBy: useFetchStatus fetchStatus should have idle status when initialized.
statusReason: Cannot read properties of undefined (reading 'value')
