[Killed] BlockStatement
core/zod/useZodLocale/useZodLocale.ts:6:104
 
 import { INVALID_FORMAT_PATTERN_TO_I18N_KEY_MAP, ZOD_LOCALE_MAP } from "~/composables/core/zod/useZodLocale/use-zod-locale.constants";
 
-function getInvalidFormatTranslation(issue: z.core.$ZodRawIssue, t: Composer["t"]): string | undefined {
-  if (issue.code !== "invalid_format" || !("pattern" in issue) || typeof issue.pattern !== "string") {
-    return undefined;
-  }
-  const i18nKey = INVALID_FORMAT_PATTERN_TO_I18N_KEY_MAP[issue.pattern as keyof typeof INVALID_FORMAT_PATTERN_TO_I18N_KEY_MAP];
-
-  if (!i18nKey) {
-    return undefined;
-  }
-  return t(i18nKey);
-}
+function getInvalidFormatTranslation(issue: z.core.$ZodRawIssue, t: Composer["t"]): string | undefined {}
 
 function getCustomErrorMessage(issue: z.core.$ZodRawIssue, t: Composer["t"]): string | undefined {
killedBy: useZodLocale Custom error translations should translate the slug regex validation error to i18n key when an invalid slug is validated.
statusReason: expected 'Invalid string: must match pattern /^…' to be 'validation.invalidKebabCase' // Object.is equality

[Killed] BooleanLiteral
core/zod/useZodLocale/useZodLocale.ts:7:42
 import { INVALID_FORMAT_PATTERN_TO_I18N_KEY_MAP, ZOD_LOCALE_MAP } from "~/composables/core/zod/useZodLocale/use-zod-locale.constants";
 
 function getInvalidFormatTranslation(issue: z.core.$ZodRawIssue, t: Composer["t"]): string | undefined {
-  if (issue.code !== "invalid_format" || !("pattern" in issue) || typeof issue.pattern !== "string") {
+  if (issue.code !== "invalid_format" || "pattern" in issue || typeof issue.pattern !== "string") {
     return undefined;
   }
killedBy: useZodLocale Custom error translations should translate the slug regex validation error to i18n key when an invalid slug is validated.
statusReason: expected 'Invalid string: must match pattern /^…' to be 'validation.invalidKebabCase' // Object.is equality

[Killed] ConditionalExpression
core/zod/useZodLocale/useZodLocale.ts:7:67
 import { INVALID_FORMAT_PATTERN_TO_I18N_KEY_MAP, ZOD_LOCALE_MAP } from "~/composables/core/zod/useZodLocale/use-zod-locale.constants";
 
 function getInvalidFormatTranslation(issue: z.core.$ZodRawIssue, t: Composer["t"]): string | undefined {
-  if (issue.code !== "invalid_format" || !("pattern" in issue) || typeof issue.pattern !== "string") {
+  if (issue.code !== "invalid_format" || !("pattern" in issue) || false) {
     return undefined;
   }
killedBy: useZodLocale getInvalidFormatTranslation should return undefined without calling t when issue pattern is not a string.
statusReason: expected 'translated' to be undefined

[Killed] ConditionalExpression
core/zod/useZodLocale/useZodLocale.ts:12:7
   }
   const i18nKey = INVALID_FORMAT_PATTERN_TO_I18N_KEY_MAP[issue.pattern as keyof typeof INVALID_FORMAT_PATTERN_TO_I18N_KEY_MAP];
 
-  if (!i18nKey) {
+  if (true) {
     return undefined;
   }
killedBy: useZodLocale Custom error translations should translate the slug regex validation error to i18n key when an invalid slug is validated.
statusReason: expected 'Invalid string: must match pattern /^…' to be 'validation.invalidKebabCase' // Object.is equality

[Killed] ConditionalExpression
core/zod/useZodLocale/useZodLocale.ts:12:7
   }
   const i18nKey = INVALID_FORMAT_PATTERN_TO_I18N_KEY_MAP[issue.pattern as keyof typeof INVALID_FORMAT_PATTERN_TO_I18N_KEY_MAP];
 
-  if (!i18nKey) {
+  if (false) {
     return undefined;
   }
killedBy: useZodLocale getInvalidFormatTranslation should return undefined without calling t when pattern does not match any known regex pattern.
statusReason: expected 'translated' to be undefined

[Killed] BlockStatement
core/zod/useZodLocale/useZodLocale.ts:18:98
   return t(i18nKey);
 }
 
-function getCustomErrorMessage(issue: z.core.$ZodRawIssue, t: Composer["t"]): string | undefined {
-  return getInvalidFormatTranslation(issue, t);
-}
+function getCustomErrorMessage(issue: z.core.$ZodRawIssue, t: Composer["t"]): string | undefined {}
 
 function isLocaleSupported(locale: string): locale is keyof typeof ZOD_LOCALE_MAP {
killedBy: useZodLocale Custom error translations should translate the slug regex validation error to i18n key when an invalid slug is validated.
statusReason: expected 'Invalid string: must match pattern /^…' to be 'validation.invalidKebabCase' // Object.is equality

[Killed] BlockStatement
core/zod/useZodLocale/useZodLocale.ts:22:83
   return getInvalidFormatTranslation(issue, t);
 }
 
-function isLocaleSupported(locale: string): locale is keyof typeof ZOD_LOCALE_MAP {
-  return locale in ZOD_LOCALE_MAP;
-}
+function isLocaleSupported(locale: string): locale is keyof typeof ZOD_LOCALE_MAP {}
 
 function useZodLocale(i18n: Composer): void {
killedBy: useZodLocale isLocaleSupported should return true when locale is supported.
statusReason: expected undefined to be truthy

[Killed] BlockStatement
core/zod/useZodLocale/useZodLocale.ts:26:45
   return locale in ZOD_LOCALE_MAP;
 }
 
-function useZodLocale(i18n: Composer): void {
-  const { locale, t } = i18n;
-
-  function setCurrentLocaleInZodConfig(currentLocale: string): void {
-    const localeFactory = isLocaleSupported(currentLocale) ? ZOD_LOCALE_MAP[currentLocale] : z.locales.en;
-
-    z.config({
-      ...localeFactory(),
-      customError: issue => getCustomErrorMessage(issue, t),
-    });
-  }
-
-  setCurrentLocaleInZodConfig(locale.value);
-
-  watch(locale, (updatedLocale: string) => {
-    setCurrentLocaleInZodConfig(updatedLocale);
-  });
-}
+function useZodLocale(i18n: Composer): void {}
 
 export {
killedBy: useZodLocale Zod locale configuration should configure Zod with a custom error function when called.
statusReason: expected undefined to be type of 'function'

[Killed] BlockStatement
core/zod/useZodLocale/useZodLocale.ts:29:69
 function useZodLocale(i18n: Composer): void {
   const { locale, t } = i18n;
 
-  function setCurrentLocaleInZodConfig(currentLocale: string): void {
-    const localeFactory = isLocaleSupported(currentLocale) ? ZOD_LOCALE_MAP[currentLocale] : z.locales.en;
-
-    z.config({
-      ...localeFactory(),
-      customError: issue => getCustomErrorMessage(issue, t),
-    });
-  }
+  function setCurrentLocaleInZodConfig(currentLocale: string): void {}
 
   setCurrentLocaleInZodConfig(locale.value);
killedBy: useZodLocale Zod locale configuration should configure Zod with a custom error function when called.
statusReason: expected undefined to be type of 'function'

[Killed] ArrowFunction
core/zod/useZodLocale/useZodLocale.ts:34:20
 
     z.config({
       ...localeFactory(),
-      customError: issue => getCustomErrorMessage(issue, t),
+      customError: () => undefined,
     });
   }
killedBy: useZodLocale Custom error translations should translate the slug regex validation error to i18n key when an invalid slug is validated.
statusReason: expected 'Invalid string: must match pattern /^…' to be 'validation.invalidKebabCase' // Object.is equality

[Killed] BlockStatement
core/zod/useZodLocale/useZodLocale.ts:40:44
 
   setCurrentLocaleInZodConfig(locale.value);
 
-  watch(locale, (updatedLocale: string) => {
-    setCurrentLocaleInZodConfig(updatedLocale);
-  });
+  watch(locale, (updatedLocale: string) => {});
 }
 
killedBy: useZodLocale Zod locale configuration should reconfigure Zod locale error map when locale changes.
statusReason: expected [Function] not to be [Function] // Object.is equality
