[Killed] BlockStatement
domain/question/helpers/question.helpers.ts:7:131
 import { QUESTION_COGNITIVE_DIFFICULTY_UI_METADATA } from "~/composables/domain/question/constants/question-cognitive-difficulty.constants";
 import type { QuestionCategoryUiMetadata, QuestionCognitiveDifficultyUiMetadata } from "~/composables/domain/question/types/question-ui-metadata.types";
 
-function getQuestionCognitiveDifficultyUiMetadata(difficulty: QuestionCognitiveDifficulty): QuestionCognitiveDifficultyUiMetadata {
-  return QUESTION_COGNITIVE_DIFFICULTY_UI_METADATA[difficulty];
-}
+function getQuestionCognitiveDifficultyUiMetadata(difficulty: QuestionCognitiveDifficulty): QuestionCognitiveDifficultyUiMetadata {}
 
 function getQuestionCategoryUiMetadata(category: QuestionCategory): QuestionCategoryUiMetadata {
killedBy: Question Helpers getQuestionCognitiveDifficultyUiMetadata should return 'easy' difficulty ui metadata when difficulty is undefined
statusReason: expected undefined to strictly equal { icon: 'i-lucide-brain', …(2) }

[Killed] BlockStatement
domain/question/helpers/question.helpers.ts:11:96
   return QUESTION_COGNITIVE_DIFFICULTY_UI_METADATA[difficulty];
 }
 
-function getQuestionCategoryUiMetadata(category: QuestionCategory): QuestionCategoryUiMetadata {
-  return QUESTION_CATEGORY_UI_METADATA[category];
-}
+function getQuestionCategoryUiMetadata(category: QuestionCategory): QuestionCategoryUiMetadata {}
 
 export {
killedBy: Question Helpers getQuestionCategoryUiMetadata should return 'trivia' category ui metadata when category is undefined
statusReason: expected undefined to strictly equal { icon: 'i-lucide-lightbulb', …(2) }
