[Killed] BlockStatement
question/helpers/shell/question.shell.helpers.ts:5:69
 import { QUESTION_DEFAULT_AUTHOR } from "~/composables/domain/question/constants/question-author.constants";
 import { createLocalizedTextShell, createLocalizedTextsShell } from "~/composables/core/localization/helpers/shell/localization.shell.helpers";
 
-function createQuestionCreationDtoShell(): QuestionCreationDtoShell {
-  return {
-    content: {
-      statement: createLocalizedTextShell(),
-      answer: createLocalizedTextShell(),
-      context: createLocalizedTextShell(),
-      trivia: createLocalizedTextsShell(),
-    },
-    cognitiveDifficulty: undefined,
-    category: undefined,
-    themes: [],
-    sourceUrls: [],
-    author: { ...QUESTION_DEFAULT_AUTHOR },
-  };
-}
+function createQuestionCreationDtoShell(): QuestionCreationDtoShell {}
 
 export { createQuestionCreationDtoShell };
killedBy: createQuestionCreationDtoShell should return a localized text shell when content field is undefined
statusReason: Cannot read properties of undefined (reading 'content')

[Killed] ObjectLiteral
question/helpers/shell/question.shell.helpers.ts:6:10
 import { createLocalizedTextShell, createLocalizedTextsShell } from "~/composables/core/localization/helpers/shell/localization.shell.helpers";
 
 function createQuestionCreationDtoShell(): QuestionCreationDtoShell {
-  return {
-    content: {
-      statement: createLocalizedTextShell(),
-      answer: createLocalizedTextShell(),
-      context: createLocalizedTextShell(),
-      trivia: createLocalizedTextsShell(),
-    },
-    cognitiveDifficulty: undefined,
-    category: undefined,
-    themes: [],
-    sourceUrls: [],
-    author: { ...QUESTION_DEFAULT_AUTHOR },
-  };
+  return {};
 }
 
killedBy: createQuestionCreationDtoShell should return a localized text shell when content field is undefined
statusReason: Cannot read properties of undefined (reading 'statement')
