[Killed] BlockStatement
domain/question-theme/helpers/question-theme.helpers.ts:6:119
 import { getLocalizedDisplayValue } from "#shared/utils/helpers/localization/localization.helpers";
 import { QUESTION_THEME_SLUG_ICON_MAP, QUESTION_THEME_UNKNOWN_ICON } from "~/composables/domain/question-theme/constants/question-theme.constants";
 
-function getThemeLocalizedLabel(theme: QuestionTheme | undefined, locale: Locale, missingTranslation: string): string {
-  if (!theme) {
-    return missingTranslation;
-  }
-  return getLocalizedDisplayValue(theme.label, locale) ?? missingTranslation;
-}
+function getThemeLocalizedLabel(theme: QuestionTheme | undefined, locale: Locale, missingTranslation: string): string {}
 
 function getThemeIcon(slug: string): string {
killedBy: Question Theme Helpers getThemeLocalizedLabel should return missing translation when undefined
statusReason: expected undefined to be 'N/A' // Object.is equality

[Killed] BooleanLiteral
domain/question-theme/helpers/question-theme.helpers.ts:7:7
 import { QUESTION_THEME_SLUG_ICON_MAP, QUESTION_THEME_UNKNOWN_ICON } from "~/composables/domain/question-theme/constants/question-theme.constants";
 
 function getThemeLocalizedLabel(theme: QuestionTheme | undefined, locale: Locale, missingTranslation: string): string {
-  if (!theme) {
+  if (theme) {
     return missingTranslation;
   }
killedBy: Question Theme Helpers getThemeLocalizedLabel should return missing translation when undefined
statusReason: Cannot read properties of undefined (reading 'label')

[Killed] ConditionalExpression
domain/question-theme/helpers/question-theme.helpers.ts:7:7
 import { QUESTION_THEME_SLUG_ICON_MAP, QUESTION_THEME_UNKNOWN_ICON } from "~/composables/domain/question-theme/constants/question-theme.constants";
 
 function getThemeLocalizedLabel(theme: QuestionTheme | undefined, locale: Locale, missingTranslation: string): string {
-  if (!theme) {
+  if (true) {
     return missingTranslation;
   }
killedBy: Question Theme Helpers getThemeLocalizedLabel should return localized label when theme has a label for the given locale.
statusReason: expected 'N/A' to be 'History' // Object.is equality

[Killed] LogicalOperator
domain/question-theme/helpers/question-theme.helpers.ts:10:10
   if (!theme) {
     return missingTranslation;
   }
-  return getLocalizedDisplayValue(theme.label, locale) ?? missingTranslation;
+  return getLocalizedDisplayValue(theme.label, locale) && missingTranslation;
 }
 
killedBy: Question Theme Helpers getThemeLocalizedLabel should return missing translation when undefined
statusReason: expected undefined to be 'N/A' // Object.is equality

[Killed] BlockStatement
domain/question-theme/helpers/question-theme.helpers.ts:13:45
   return getLocalizedDisplayValue(theme.label, locale) ?? missingTranslation;
 }
 
-function getThemeIcon(slug: string): string {
-  return QUESTION_THEME_SLUG_ICON_MAP[slug] ?? QUESTION_THEME_UNKNOWN_ICON;
-}
+function getThemeIcon(slug: string): string {}
 
 export {
killedBy: Question Theme Helpers getThemeIcon should return icon 'i-lucide-landmark' when the slug is undefined
statusReason: expected undefined to be 'i-lucide-landmark' // Object.is equality

[Killed] LogicalOperator
domain/question-theme/helpers/question-theme.helpers.ts:14:10
 }
 
 function getThemeIcon(slug: string): string {
-  return QUESTION_THEME_SLUG_ICON_MAP[slug] ?? QUESTION_THEME_UNKNOWN_ICON;
+  return QUESTION_THEME_SLUG_ICON_MAP[slug] && QUESTION_THEME_UNKNOWN_ICON;
 }
 
killedBy: Question Theme Helpers getThemeIcon should return icon 'i-lucide-landmark' when the slug is undefined
statusReason: expected 'i-lucide-circle-help' to be 'i-lucide-landmark' // Object.is equality
