[Killed] BlockStatement
question-theme/helpers/shell/question-theme.shell.helpers.ts:4:79
 import type { QuestionThemeCreationDtoShell } from "#shared/types/question-theme.types";
 import { createLocalizedTextShell, createLocalizedTextsShell } from "~/composables/core/localization/helpers/shell/localization.shell.helpers";
 
-function createQuestionThemeCreationDtoShell(): QuestionThemeCreationDtoShell {
-  return {
-    slug: undefined,
-    label: createLocalizedTextShell(),
-    description: createLocalizedTextShell(),
-    aliases: createLocalizedTextsShell(),
-    color: undefined,
-  };
-}
+function createQuestionThemeCreationDtoShell(): QuestionThemeCreationDtoShell {}
 
 export {
killedBy: createQuestionThemeCreationDtoShell should return a shell with all fields set to undefined when called.
statusReason: expected undefined to strictly equal { slug: undefined, …(4) }
