[Killed] BlockStatement
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:9:63
   handleGoatItApiError: (error: unknown, title: string) => void;
 };
 
-function extractErrorCode(error: unknown): string | undefined {
-  if (!(error instanceof FetchError)) {
-    return undefined;
-  }
-
-  if (!isRecord(error.data)) {
-    return undefined;
-  }
-
-  if (!isRecord(error.data.data)) {
-    return undefined;
-  }
-
-  const { errorCode } = error.data.data;
-
-  if (typeof errorCode !== "string") {
-    return undefined;
-  }
-  return errorCode;
-}
+function extractErrorCode(error: unknown): string | undefined {}
 
 function useGoatItApiErrorToast(): UseGoatItApiErrorToast {
killedBy: useGoatItApiErrorToast extractErrorCode should return the error code when error is a FetchError with a valid string errorCode.
statusReason: expected undefined to be 'someErrorCode' // Object.is equality

[Killed] BlockStatement
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:10:39
 };
 
 function extractErrorCode(error: unknown): string | undefined {
-  if (!(error instanceof FetchError)) {
-    return undefined;
-  }
+  if (!(error instanceof FetchError)) {}
 
   if (!isRecord(error.data)) {
killedBy: useGoatItApiErrorToast extractErrorCode should return undefined when error is not a FetchError.
statusReason: expected 'shouldNotBeExtracted' to be undefined

[Killed] ConditionalExpression
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:10:7
 };
 
 function extractErrorCode(error: unknown): string | undefined {
-  if (!(error instanceof FetchError)) {
+  if (false) {
     return undefined;
   }
killedBy: useGoatItApiErrorToast extractErrorCode should return undefined when error is not a FetchError.
statusReason: expected 'shouldNotBeExtracted' to be undefined

[Killed] BlockStatement
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:14:30
     return undefined;
   }
 
-  if (!isRecord(error.data)) {
-    return undefined;
-  }
+  if (!isRecord(error.data)) {}
 
   if (!isRecord(error.data.data)) {
killedBy: useGoatItApiErrorToast extractErrorCode should return undefined when error is a FetchError with no data.
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:14:7
     return undefined;
   }
 
-  if (!isRecord(error.data)) {
+  if (false) {
     return undefined;
   }
killedBy: useGoatItApiErrorToast extractErrorCode should return undefined when error is a FetchError with no data.
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:18:35
     return undefined;
   }
 
-  if (!isRecord(error.data.data)) {
-    return undefined;
-  }
+  if (!isRecord(error.data.data)) {}
 
   const { errorCode } = error.data.data;
killedBy: useGoatItApiErrorToast extractErrorCode should return undefined when error is a FetchError with null nested data.
statusReason: Cannot destructure property 'errorCode' of 'error.data.data' as it is null.

[Killed] ConditionalExpression
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:18:7
     return undefined;
   }
 
-  if (!isRecord(error.data.data)) {
+  if (true) {
     return undefined;
   }
killedBy: useGoatItApiErrorToast extractErrorCode should return the error code when error is a FetchError with a valid string errorCode.
statusReason: expected undefined to be 'someErrorCode' // Object.is equality

[Killed] EqualityOperator
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:24:7
 
   const { errorCode } = error.data.data;
 
-  if (typeof errorCode !== "string") {
+  if (typeof errorCode === "string") {
     return undefined;
   }
killedBy: useGoatItApiErrorToast extractErrorCode should return the error code when error is a FetchError with a valid string errorCode.
statusReason: expected undefined to be 'someErrorCode' // Object.is equality

[Killed] BlockStatement
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:24:38
 
   const { errorCode } = error.data.data;
 
-  if (typeof errorCode !== "string") {
-    return undefined;
-  }
+  if (typeof errorCode !== "string") {}
   return errorCode;
 }
killedBy: useGoatItApiErrorToast extractErrorCode should return undefined when error is a FetchError with non-string errorCode.
statusReason: expected 123 to be undefined

[Killed] BlockStatement
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:34:70
   const { addErrorToast } = useAppToast();
   const i18n = useI18n();
 
-  function handleGoatItApiError(error: unknown, title: string): void {
-    const errorCodeValue = extractErrorCode(error);
-
-    if (errorCodeValue === undefined || errorCodeValue === "") {
-      addErrorToast({ title, description: i18n.t("errors.unknown"), id: "api-error-unknown" });
-
-      return;
-    }
-
-    const i18nKey = `errors.goatItApi.${errorCodeValue}`;
-
-    if (i18n.te(i18nKey)) {
-      addErrorToast({ title, description: i18n.t(i18nKey), id: `api-error-${errorCodeValue}` });
-
-      return;
-    }
-
-    console.error(`Unknown Goat It API error code: ${errorCodeValue}`);
-    addErrorToast({ title, description: i18n.t("errors.unknown"), id: "api-error-unknown" });
-  }
+  function handleGoatItApiError(error: unknown, title: string): void {}
   return { handleGoatItApiError };
 }
killedBy: useGoatItApiErrorToast handleGoatItApiError should check if translation exists for the error code key when error is a FetchError with an errorCode.
statusReason: expected "vi.fn()" to be called once with arguments: [ Array(1) ]

Number of calls: 0

[Killed] EqualityOperator
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:37:9
   function handleGoatItApiError(error: unknown, title: string): void {
     const errorCodeValue = extractErrorCode(error);
 
-    if (errorCodeValue === undefined || errorCodeValue === "") {
+    if (errorCodeValue !== undefined || errorCodeValue === "") {
       addErrorToast({ title, description: i18n.t("errors.unknown"), id: "api-error-unknown" });
 
killedBy: useGoatItApiErrorToast handleGoatItApiError should check if translation exists for the error code key when error is a FetchError with an errorCode.
statusReason: expected "vi.fn()" to be called once with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:37:9
   function handleGoatItApiError(error: unknown, title: string): void {
     const errorCodeValue = extractErrorCode(error);
 
-    if (errorCodeValue === undefined || errorCodeValue === "") {
+    if (false) {
       addErrorToast({ title, description: i18n.t("errors.unknown"), id: "api-error-unknown" });
 
killedBy: useGoatItApiErrorToast handleGoatItApiError should not check translation key when error is a FetchError with no errorCode.
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "errors.goatItApi.undefined",

[Killed] StringLiteral
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:43:21
       return;
     }
 
-    const i18nKey = `errors.goatItApi.${errorCodeValue}`;
+    const i18nKey = ``;
 
     if (i18n.te(i18nKey)) {
killedBy: useGoatItApiErrorToast handleGoatItApiError should check if translation exists for the error code key when error is a FetchError with an errorCode.
statusReason: expected "vi.fn()" to be called once with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "errors.goatItApi.questionThemeReferencedByLiveQuestions",

[Killed] ConditionalExpression
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:45:9
 
     const i18nKey = `errors.goatItApi.${errorCodeValue}`;
 
-    if (i18n.te(i18nKey)) {
+    if (false) {
       addErrorToast({ title, description: i18n.t(i18nKey), id: `api-error-${errorCodeValue}` });
 
killedBy: useGoatItApiErrorToast handleGoatItApiError should check if translation exists for the error code key when error is a FetchError with an errorCode.
statusReason: expected "vi.fn()" to be called once with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:45:27
 
     const i18nKey = `errors.goatItApi.${errorCodeValue}`;
 
-    if (i18n.te(i18nKey)) {
-      addErrorToast({ title, description: i18n.t(i18nKey), id: `api-error-${errorCodeValue}` });
-
-      return;
-    }
+    if (i18n.te(i18nKey)) {}
 
     console.error(`Unknown Goat It API error code: ${errorCodeValue}`);
killedBy: useGoatItApiErrorToast handleGoatItApiError should call addErrorToast with title and translated error code description when error is a FetchError with a known errorCode.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(3) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] StringLiteral
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:46:64
     const i18nKey = `errors.goatItApi.${errorCodeValue}`;
 
     if (i18n.te(i18nKey)) {
-      addErrorToast({ title, description: i18n.t(i18nKey), id: `api-error-${errorCodeValue}` });
+      addErrorToast({ title, description: i18n.t(i18nKey), id: `` });
 
       return;
killedBy: useGoatItApiErrorToast handleGoatItApiError should call addErrorToast with title and translated error code description when error is a FetchError with a known errorCode.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(3) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] StringLiteral
composables/domain/useGoatItApiErrorToast/useGoatItApiErrorToast.ts:52:71
     }
 
     console.error(`Unknown Goat It API error code: ${errorCodeValue}`);
-    addErrorToast({ title, description: i18n.t("errors.unknown"), id: "api-error-unknown" });
+    addErrorToast({ title, description: i18n.t("errors.unknown"), id: "" });
   }
   return { handleGoatItApiError };
killedBy: useGoatItApiErrorToast handleGoatItApiError should call addErrorToast with generic fallback description when error is a FetchError with an unknown errorCode.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(3) } ]

Received:

  1st vi.fn() call:

  [
    {
