[Killed] BlockStatement
composables/ui/useAppToast/useAppToast.ts:12:59
   const toast = useToast();
   const { t } = useI18n();
 
-  function addSuccessToast(options: Partial<Toast>): void {
-    toast.add({
-      icon: "i-lucide-circle-check-big",
-      color: "success",
-      title: t("common.success"),
-      ...options,
-    });
-  }
+  function addSuccessToast(options: Partial<Toast>): void {}
 
   function addErrorToast(options: Partial<Toast>): void {
killedBy: useAppToast addSuccessToast should add toast with success defaults when called with no extra options.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(3) } ]

Number of calls: 0

[Killed] BlockStatement
composables/ui/useAppToast/useAppToast.ts:21:57
     });
   }
 
-  function addErrorToast(options: Partial<Toast>): void {
-    toast.add({
-      icon: "i-lucide-ban",
-      color: "error",
-      title: t("common.error"),
-      ...options,
-    });
-  }
+  function addErrorToast(options: Partial<Toast>): void {}
   return {
     addSuccessToast,
killedBy: useAppToast addErrorToast should add toast with error defaults when called with no extra options.
statusReason: expected "vi.fn()" to be called once with arguments: [ { icon: 'i-lucide-ban', …(2) } ]

Number of calls: 0

[Killed] StringLiteral
composables/ui/useAppToast/useAppToast.ts:23:13
 
   function addErrorToast(options: Partial<Toast>): void {
     toast.add({
-      icon: "i-lucide-ban",
+      icon: "",
       color: "error",
       title: t("common.error"),
killedBy: useAppToast addErrorToast should add toast with error defaults when called with no extra options.
statusReason: expected "vi.fn()" to be called once with arguments: [ { icon: 'i-lucide-ban', …(2) } ]

Received:

  1st vi.fn() call:

  [
    {
