[Killed] BlockStatement
composables/ui/useHexColor/useHexColor.ts:8:75
 import { LIGHT_COLOR_MODE } from "~/utils/constants/color/color.constants";
 import type { UseHexColor } from "~/composables/ui/useHexColor/hex-color.types";
 
-function useHexColor(color: ComputedRef<string | undefined>): UseHexColor {
-  const colorMode = useColorMode();
-
-  const adaptedColor = computed<string>(() => {
-    const rawColor = color.value;
-
-    if (rawColor === undefined) {
-      return HEX_COLOR_DEFAULT_NEUTRAL;
-    }
-
-    if (colorMode.value === LIGHT_COLOR_MODE) {
-      return darkenHexColor(rawColor, HEX_COLOR_DARKEN_AMOUNT);
-    }
-    return lightenHexColor(rawColor, HEX_COLOR_LIGHTEN_AMOUNT);
-  });
-
-  return {
-    adaptedColor,
-  };
-}
+function useHexColor(color: ComputedRef<string | undefined>): UseHexColor {}
 
 export {
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: Cannot destructure property 'adaptedColor' of 'useHexColor(...)' as it is undefined.

[Killed] BlockStatement
composables/ui/useHexColor/useHexColor.ts:11:47
 function useHexColor(color: ComputedRef<string | undefined>): UseHexColor {
   const colorMode = useColorMode();
 
-  const adaptedColor = computed<string>(() => {
-    const rawColor = color.value;
-
-    if (rawColor === undefined) {
-      return HEX_COLOR_DEFAULT_NEUTRAL;
-    }
-
-    if (colorMode.value === LIGHT_COLOR_MODE) {
-      return darkenHexColor(rawColor, HEX_COLOR_DARKEN_AMOUNT);
-    }
-    return lightenHexColor(rawColor, HEX_COLOR_LIGHTEN_AMOUNT);
-  });
+  const adaptedColor = computed<string>(() => {});
 
   return {
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected undefined to be '#cc0000' // Object.is equality

[Killed] ConditionalExpression
composables/ui/useHexColor/useHexColor.ts:14:9
   const adaptedColor = computed<string>(() => {
     const rawColor = color.value;
 
-    if (rawColor === undefined) {
+    if (true) {
       return HEX_COLOR_DEFAULT_NEUTRAL;
     }
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected '#6b7280' to be '#cc0000' // Object.is equality

[Killed] ConditionalExpression
composables/ui/useHexColor/useHexColor.ts:14:9
   const adaptedColor = computed<string>(() => {
     const rawColor = color.value;
 
-    if (rawColor === undefined) {
+    if (false) {
       return HEX_COLOR_DEFAULT_NEUTRAL;
     }
killedBy: useHexColor adaptedColor should return the default neutral color when color is undefined.
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
composables/ui/useHexColor/useHexColor.ts:18:47
       return HEX_COLOR_DEFAULT_NEUTRAL;
     }
 
-    if (colorMode.value === LIGHT_COLOR_MODE) {
-      return darkenHexColor(rawColor, HEX_COLOR_DARKEN_AMOUNT);
-    }
+    if (colorMode.value === LIGHT_COLOR_MODE) {}
     return lightenHexColor(rawColor, HEX_COLOR_LIGHTEN_AMOUNT);
   });
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected '#ff3333' to be '#cc0000' // Object.is equality

[Killed] ConditionalExpression
composables/ui/useHexColor/useHexColor.ts:18:9
       return HEX_COLOR_DEFAULT_NEUTRAL;
     }
 
-    if (colorMode.value === LIGHT_COLOR_MODE) {
+    if (true) {
       return darkenHexColor(rawColor, HEX_COLOR_DARKEN_AMOUNT);
     }
killedBy: useHexColor adaptedColor should return a lightened color when color is defined and mode is dark.
statusReason: expected '#cc0000' to be '#ff3333' // Object.is equality
