[Killed] ArrowFunction
composables/ui/useTableFilters/useTableFilters.ts:6:52
 function useTableFilters<T extends FilterDefinitions>(options: UseTableFiltersOptions<T>): UseTableFilters<T> {
   const { definitions } = options;
 
-  const defaults = Object.entries(definitions).map(([key, definition]) => ({
-    key,
-    default: definition.default,
-  }));
+  const defaults = Object.entries(definitions).map(() => undefined);
 
   // Acceptable as Object.fromEntries loses key typing; the cast is safe because we build entries from the same keys
killedBy: useTableFilters filters should initialize the filter to its default value when created with a single filter.
statusReason: Cannot destructure property 'key' of 'undefined' as it is undefined.

[Killed] MethodExpression
composables/ui/useTableFilters/useTableFilters.ts:15:52
   // oxlint-disable-next-line no-unsafe-type-assertion
   const filters = Object.fromEntries(defaults.map(({ key, default: defaultValue }) => [key, ref(defaultValue)])) as FilterRefs<T>;
 
-  const activeFilterCount = computed<number>(() => defaults.filter(({ key, default: defaultValue }) => {
-    const currentValue = filters[key as keyof typeof filters].value;
-    if (Array.isArray(currentValue)) {
-      return currentValue.length > 0;
-    }
-    return currentValue !== defaultValue;
-  }).length);
+  const activeFilterCount = computed<number>(() => defaults.length);
 
   const hasActiveFilters = computed<boolean>(() => activeFilterCount.value > 0);
killedBy: useTableFilters activeFilterCount should return 0 when no filters differ from their defaults.
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
composables/ui/useTableFilters/useTableFilters.ts:15:46
   // oxlint-disable-next-line no-unsafe-type-assertion
   const filters = Object.fromEntries(defaults.map(({ key, default: defaultValue }) => [key, ref(defaultValue)])) as FilterRefs<T>;
 
-  const activeFilterCount = computed<number>(() => defaults.filter(({ key, default: defaultValue }) => {
-    const currentValue = filters[key as keyof typeof filters].value;
-    if (Array.isArray(currentValue)) {
-      return currentValue.length > 0;
-    }
-    return currentValue !== defaultValue;
-  }).length);
+  const activeFilterCount = computed<number>(() => undefined);
 
   const hasActiveFilters = computed<boolean>(() => activeFilterCount.value > 0);
killedBy: useTableFilters activeFilterCount should return 0 when no filters differ from their defaults.
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
composables/ui/useTableFilters/useTableFilters.ts:17:9
 
   const activeFilterCount = computed<number>(() => defaults.filter(({ key, default: defaultValue }) => {
     const currentValue = filters[key as keyof typeof filters].value;
-    if (Array.isArray(currentValue)) {
+    if (true) {
       return currentValue.length > 0;
     }
killedBy: useTableFilters activeFilterCount should return 0 when no filters differ from their defaults.
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
composables/ui/useTableFilters/useTableFilters.ts:17:9
 
   const activeFilterCount = computed<number>(() => defaults.filter(({ key, default: defaultValue }) => {
     const currentValue = filters[key as keyof typeof filters].value;
-    if (Array.isArray(currentValue)) {
+    if (false) {
       return currentValue.length > 0;
     }
killedBy: useTableFilters activeFilterCount should return 0 when an array filter is empty.
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
composables/ui/useTableFilters/useTableFilters.ts:18:14
   const activeFilterCount = computed<number>(() => defaults.filter(({ key, default: defaultValue }) => {
     const currentValue = filters[key as keyof typeof filters].value;
     if (Array.isArray(currentValue)) {
-      return currentValue.length > 0;
+      return true;
     }
     return currentValue !== defaultValue;
killedBy: useTableFilters activeFilterCount should return 0 when an array filter is empty.
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
composables/ui/useTableFilters/useTableFilters.ts:18:14
   const activeFilterCount = computed<number>(() => defaults.filter(({ key, default: defaultValue }) => {
     const currentValue = filters[key as keyof typeof filters].value;
     if (Array.isArray(currentValue)) {
-      return currentValue.length > 0;
+      return false;
     }
     return currentValue !== defaultValue;
killedBy: useTableFilters activeFilterCount should return 1 when an array filter contains items.
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
composables/ui/useTableFilters/useTableFilters.ts:20:12
     if (Array.isArray(currentValue)) {
       return currentValue.length > 0;
     }
-    return currentValue !== defaultValue;
+    return true;
   }).length);
 
killedBy: useTableFilters activeFilterCount should return 0 when no filters differ from their defaults.
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
composables/ui/useTableFilters/useTableFilters.ts:20:12
     if (Array.isArray(currentValue)) {
       return currentValue.length > 0;
     }
-    return currentValue !== defaultValue;
+    return false;
   }).length);
 
killedBy: useTableFilters activeFilterCount should return 1 when one filter differs from its default.
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
composables/ui/useTableFilters/useTableFilters.ts:23:52
     return currentValue !== defaultValue;
   }).length);
 
-  const hasActiveFilters = computed<boolean>(() => activeFilterCount.value > 0);
+  const hasActiveFilters = computed<boolean>(() => activeFilterCount.value <= 0);
 
   function clearFilters(): void {
killedBy: useTableFilters hasActiveFilters should return false when no filters are active.
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
composables/ui/useTableFilters/useTableFilters.ts:23:52
     return currentValue !== defaultValue;
   }).length);
 
-  const hasActiveFilters = computed<boolean>(() => activeFilterCount.value > 0);
+  const hasActiveFilters = computed<boolean>(() => true);
 
   function clearFilters(): void {
killedBy: useTableFilters hasActiveFilters should return false when no filters are active.
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
composables/ui/useTableFilters/useTableFilters.ts:25:33
 
   const hasActiveFilters = computed<boolean>(() => activeFilterCount.value > 0);
 
-  function clearFilters(): void {
-    for (const { key, default: defaultValue } of defaults) {
-      filters[key as keyof typeof filters].value = defaultValue;
-    }
-  }
+  function clearFilters(): void {}
 
   function setFilterValue<K extends keyof T>(key: K, value: T[K]["default"]): void {
killedBy: useTableFilters clearFilters should reset the first filter to its default value when called.
statusReason: expected 'active' to be undefined

[Killed] BlockStatement
composables/ui/useTableFilters/useTableFilters.ts:26:60
   const hasActiveFilters = computed<boolean>(() => activeFilterCount.value > 0);
 
   function clearFilters(): void {
-    for (const { key, default: defaultValue } of defaults) {
-      filters[key as keyof typeof filters].value = defaultValue;
-    }
+    for (const { key, default: defaultValue } of defaults) {}
   }
 
killedBy: useTableFilters clearFilters should reset the first filter to its default value when called.
statusReason: expected 'active' to be undefined

[Killed] BlockStatement
composables/ui/useTableFilters/useTableFilters.ts:31:84
     }
   }
 
-  function setFilterValue<K extends keyof T>(key: K, value: T[K]["default"]): void {
-    filters[key].value = value;
-  }
+  function setFilterValue<K extends keyof T>(key: K, value: T[K]["default"]): void {}
   return {
     filters,
killedBy: useTableFilters setFilterValue should set the filter value for the given key when called.
statusReason: expected undefined to be 'active' // Object.is equality

[Killed] ObjectLiteral
composables/ui/useTableFilters/useTableFilters.ts:34:10
   function setFilterValue<K extends keyof T>(key: K, value: T[K]["default"]): void {
     filters[key].value = value;
   }
-  return {
-    filters,
-    activeFilterCount,
-    hasActiveFilters,
-    clearFilters,
-    setFilterValue,
-  };
+  return {};
 }
 
killedBy: useTableFilters filters should initialize the filter to its default value when created with a single filter.
statusReason: Cannot read properties of undefined (reading 'status')
