[Killed] StringLiteral
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:10:34
 function useTableGlobalFilter<T>(options: UseTableGlobalFilterOptions<T>): UseTableGlobalFilter<T> {
   const { data, keys, fuseOptions, debounceMs = 0 } = options;
 
-  const searchTerm = ref<string>("");
+  const searchTerm = ref<string>("Stryker was here!");
 
   const globalFilter = debounceMs > 0 ? refDebounced(searchTerm, debounceMs) : searchTerm;
killedBy: useTableGlobalFilter searchTerm should initialize searchTerm as an empty string when composable is created.
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] ConditionalExpression
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:12:24
 
   const searchTerm = ref<string>("");
 
-  const globalFilter = debounceMs > 0 ? refDebounced(searchTerm, debounceMs) : searchTerm;
+  const globalFilter = false ? refDebounced(searchTerm, debounceMs) : searchTerm;
 
   const resolvedKeys = computed<string[]>(() => toValue(keys));
killedBy: useTableGlobalFilter globalFilter should not update globalFilter immediately when debounceMs is greater than 0.
statusReason: expected 'test' to be '' // Object.is equality

[Killed] EqualityOperator
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:12:24
 
   const searchTerm = ref<string>("");
 
-  const globalFilter = debounceMs > 0 ? refDebounced(searchTerm, debounceMs) : searchTerm;
+  const globalFilter = debounceMs >= 0 ? refDebounced(searchTerm, debounceMs) : searchTerm;
 
   const resolvedKeys = computed<string[]>(() => toValue(keys));
killedBy: useTableGlobalFilter globalFilter should be the same ref as searchTerm when no debounce is configured.
statusReason: expected '' to be 'test' // Object.is equality

[Killed] ArrowFunction
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:14:43
 
   const globalFilter = debounceMs > 0 ? refDebounced(searchTerm, debounceMs) : searchTerm;
 
-  const resolvedKeys = computed<string[]>(() => toValue(keys));
+  const resolvedKeys = computed<string[]>(() => undefined);
 
   const fuse = computed<Fuse<T>>(() => new Fuse(toValue(data), {
killedBy: useTableGlobalFilter globalFilterFunction should return true when globalFilter is undefined
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] ArrowFunction
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:16:34
 
   const resolvedKeys = computed<string[]>(() => toValue(keys));
 
-  const fuse = computed<Fuse<T>>(() => new Fuse(toValue(data), {
-    ...DEFAULT_FUSE_OPTIONS,
-    ...fuseOptions,
-    keys: resolvedKeys.value,
-  }));
+  const fuse = computed<Fuse<T>>(() => undefined);
 
   const matchingReferenceIndices = computed<Set<number>>(() => {
killedBy: useTableGlobalFilter globalFilterFunction should return true when globalFilter is undefined
statusReason: Cannot read properties of undefined (reading 'search')

[Killed] ObjectLiteral
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:16:64
 
   const resolvedKeys = computed<string[]>(() => toValue(keys));
 
-  const fuse = computed<Fuse<T>>(() => new Fuse(toValue(data), {
-    ...DEFAULT_FUSE_OPTIONS,
-    ...fuseOptions,
-    keys: resolvedKeys.value,
-  }));
+  const fuse = computed<Fuse<T>>(() => new Fuse(toValue(data), {}));
 
   const matchingReferenceIndices = computed<Set<number>>(() => {
killedBy: useTableGlobalFilter globalFilterFunction should return true when globalFilter is undefined
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:22:64
     keys: resolvedKeys.value,
   }));
 
-  const matchingReferenceIndices = computed<Set<number>>(() => {
-    const filterValue = globalFilter.value.trim();
-    const results = fuse.value.search(filterValue);
-
-    return new Set(results.map(result => result.refIndex));
-  });
+  const matchingReferenceIndices = computed<Set<number>>(() => {});
 
   const globalFilterFunction: FilterFn<T> = (row: Row<T>): boolean => matchingReferenceIndices.value.has(row.index);
killedBy: useTableGlobalFilter globalFilterFunction should return true when globalFilter is undefined
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] MethodExpression
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:23:25
   }));
 
   const matchingReferenceIndices = computed<Set<number>>(() => {
-    const filterValue = globalFilter.value.trim();
+    const filterValue = globalFilter.value;
     const results = fuse.value.search(filterValue);
 
killedBy: useTableGlobalFilter globalFilterFunction should return true when globalFilter is undefined
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:26:32
     const filterValue = globalFilter.value.trim();
     const results = fuse.value.search(filterValue);
 
-    return new Set(results.map(result => result.refIndex));
+    return new Set(results.map(() => undefined));
   });
 
killedBy: useTableGlobalFilter globalFilterFunction should return true when globalFilter is undefined
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:29:45
     return new Set(results.map(result => result.refIndex));
   });
 
-  const globalFilterFunction: FilterFn<T> = (row: Row<T>): boolean => matchingReferenceIndices.value.has(row.index);
+  const globalFilterFunction: FilterFn<T> = () => undefined;
 
   globalFilterFunction.autoRemove = (value: unknown): boolean => typeof value !== "string" || !value.trim();
killedBy: useTableGlobalFilter globalFilterFunction should return true when globalFilter is undefined
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:31:95
 
   const globalFilterFunction: FilterFn<T> = (row: Row<T>): boolean => matchingReferenceIndices.value.has(row.index);
 
-  globalFilterFunction.autoRemove = (value: unknown): boolean => typeof value !== "string" || !value.trim();
+  globalFilterFunction.autoRemove = (value: unknown): boolean => typeof value !== "string" || value.trim();
 
   const hasActiveFilter = computed<boolean>(() => globalFilter.value.trim().length > 0);
killedBy: useTableGlobalFilter autoRemove should return true when the filter value is undefined
statusReason: expected '' to be true // Object.is equality

[Killed] ArrowFunction
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:31:37
 
   const globalFilterFunction: FilterFn<T> = (row: Row<T>): boolean => matchingReferenceIndices.value.has(row.index);
 
-  globalFilterFunction.autoRemove = (value: unknown): boolean => typeof value !== "string" || !value.trim();
+  globalFilterFunction.autoRemove = () => undefined;
 
   const hasActiveFilter = computed<boolean>(() => globalFilter.value.trim().length > 0);
killedBy: useTableGlobalFilter autoRemove should return true when the filter value is undefined
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:33:51
 
   globalFilterFunction.autoRemove = (value: unknown): boolean => typeof value !== "string" || !value.trim();
 
-  const hasActiveFilter = computed<boolean>(() => globalFilter.value.trim().length > 0);
+  const hasActiveFilter = computed<boolean>(() => globalFilter.value.trim().length <= 0);
 
   const filteredCount = computed<number>(() => matchingReferenceIndices.value.size);
killedBy: useTableGlobalFilter hasActiveFilter should return false when searchTerm is empty.
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:33:51
 
   globalFilterFunction.autoRemove = (value: unknown): boolean => typeof value !== "string" || !value.trim();
 
-  const hasActiveFilter = computed<boolean>(() => globalFilter.value.trim().length > 0);
+  const hasActiveFilter = computed<boolean>(() => true);
 
   const filteredCount = computed<number>(() => matchingReferenceIndices.value.size);
killedBy: useTableGlobalFilter hasActiveFilter should return false when searchTerm is empty.
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
composables/ui/useTableGlobalFilter/useTableGlobalFilter.ts:35:42
 
   const hasActiveFilter = computed<boolean>(() => globalFilter.value.trim().length > 0);
 
-  const filteredCount = computed<number>(() => matchingReferenceIndices.value.size);
+  const filteredCount = computed<number>(() => undefined);
 
   return {
killedBy: useTableGlobalFilter filteredCount should return 3 when undefined
statusReason: expected undefined to be 3 // Object.is equality
