[Killed] ArrowFunction
stores/domain/question/questions.store.ts:21:5
     isError: isFetchingQuestionsError,
   } = useAsyncAction(
     repository.getAll,
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantFetch")),
+    () => undefined,
   );
 
killedBy: useQuestionsStore useAsyncAction setup for fetch should call handleGoatItApiError with the error and cantFetch translation key when the fetch error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: fetch failed, …(1) ]

Number of calls: 0

[Killed] StringLiteral
stores/domain/question/questions.store.ts:21:67
     isError: isFetchingQuestionsError,
   } = useAsyncAction(
     repository.getAll,
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantFetch")),
+    (thrownError: unknown) => handleGoatItApiError(thrownError, t("")),
   );
 
killedBy: useQuestionsStore useAsyncAction setup for fetch should call handleGoatItApiError with the error and cantFetch translation key when the fetch error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: fetch failed, …(1) ]

Received:

  1st vi.fn() call:

  [
    Error {

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:31:5
     isSuccess: isCreateQuestionSuccess,
     isError: isCreatingQuestionError,
   } = useAsyncAction(
-    async(creationDto: QuestionCreationDto) => repository.create(creationDto),
+    () => undefined,
     (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantCreate")),
   );
killedBy: useQuestionsStore useAsyncAction setup for create should pass an async function calling repository.create as action to useAsyncAction when created.
statusReason: expected "vi.fn()" to be called once with arguments: [ { category: 'lexicon', …(5) } ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:32:5
     isError: isCreatingQuestionError,
   } = useAsyncAction(
     async(creationDto: QuestionCreationDto) => repository.create(creationDto),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantCreate")),
+    () => undefined,
   );
 
killedBy: useQuestionsStore useAsyncAction setup for create should call handleGoatItApiError with the error and cantCreate translation key when the create error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: create failed, …(1) ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:42:5
     isSuccess: isArchiveQuestionSuccess,
     isError: isArchivingQuestionError,
   } = useAsyncAction(
-    async(id: string) => repository.archive(id),
+    () => undefined,
     (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantArchive")),
   );
killedBy: useQuestionsStore useAsyncAction setup for archive should pass an async function calling repository.archive as action to useAsyncAction when created.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'question-id-123' ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:43:5
     isError: isArchivingQuestionError,
   } = useAsyncAction(
     async(id: string) => repository.archive(id),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantArchive")),
+    () => undefined,
   );
 
killedBy: useQuestionsStore useAsyncAction setup for archive should call handleGoatItApiError with the error and cantArchive translation key when the archive error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: archive failed, …(1) ]

Number of calls: 0

[Killed] StringLiteral
stores/domain/question/questions.store.ts:43:67
     isError: isArchivingQuestionError,
   } = useAsyncAction(
     async(id: string) => repository.archive(id),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantArchive")),
+    (thrownError: unknown) => handleGoatItApiError(thrownError, t("")),
   );
 
killedBy: useQuestionsStore useAsyncAction setup for archive should call handleGoatItApiError with the error and cantArchive translation key when the archive error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: archive failed, …(1) ]

Received:

  1st vi.fn() call:

  [
    Error {

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:53:5
     isSuccess: isAssignThemeToQuestionSuccess,
     isError: isAssigningThemeToQuestionError,
   } = useAsyncAction(
-    async(id: string, dto: QuestionThemeAssignmentCreationDto) => repository.assignTheme(id, dto),
+    () => undefined,
     (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantAssignTheme")),
   );
killedBy: useQuestionsStore useAsyncAction setup for assignTheme should pass an async function calling repository.assignTheme as action to useAsyncAction when created.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'question-id-123', …(1) ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:54:5
     isError: isAssigningThemeToQuestionError,
   } = useAsyncAction(
     async(id: string, dto: QuestionThemeAssignmentCreationDto) => repository.assignTheme(id, dto),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantAssignTheme")),
+    () => undefined,
   );
 
killedBy: useQuestionsStore useAsyncAction setup for assignTheme should call handleGoatItApiError with the error and cantAssignTheme translation key when the assignTheme error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: assignTheme failed, …(1) ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:64:5
     isSuccess: isRemoveThemeFromQuestionSuccess,
     isError: isRemovingThemeFromQuestionError,
   } = useAsyncAction(
-    async(id: string, themeId: string) => repository.removeTheme(id, themeId),
+    () => undefined,
     (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantRemoveTheme")),
   );
killedBy: useQuestionsStore useAsyncAction setup for removeTheme should pass an async function calling repository.removeTheme as action to useAsyncAction when created.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'question-id-123', 'theme-id-456' ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:65:5
     isError: isRemovingThemeFromQuestionError,
   } = useAsyncAction(
     async(id: string, themeId: string) => repository.removeTheme(id, themeId),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantRemoveTheme")),
+    () => undefined,
   );
 
killedBy: useQuestionsStore useAsyncAction setup for removeTheme should call handleGoatItApiError with the error and cantRemoveTheme translation key when the removeTheme error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: removeTheme failed, …(1) ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:75:5
     isSuccess: isModifyQuestionThemeAssignmentSuccess,
     isError: isModifyingQuestionThemeAssignmentError,
   } = useAsyncAction(
-    async(id: string, themeId: string, dto: QuestionThemeAssignmentModificationDto) => repository.modifyThemeAssignment(id, themeId, dto),
+    () => undefined,
     (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantModifyThemeAssignment")),
   );
killedBy: useQuestionsStore useAsyncAction setup for modifyThemeAssignment should pass an async function calling repository.modifyThemeAssignment as action to useAsyncAction when created.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'question-id-123', …(2) ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:76:5
     isError: isModifyingQuestionThemeAssignmentError,
   } = useAsyncAction(
     async(id: string, themeId: string, dto: QuestionThemeAssignmentModificationDto) => repository.modifyThemeAssignment(id, themeId, dto),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantModifyThemeAssignment")),
+    () => undefined,
   );
 
killedBy: useQuestionsStore useAsyncAction setup for modifyThemeAssignment should call handleGoatItApiError with the error and cantModifyThemeAssignment translation key when the modifyThemeAssignment error call
statusReason: expected "vi.fn()" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:86:5
     isSuccess: isModifyQuestionSuccess,
     isError: isModifyingQuestionError,
   } = useAsyncAction(
-    async(id: string, dto: QuestionModificationDto) => repository.modify(id, dto),
+    () => undefined,
     (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantModify")),
   );
killedBy: useQuestionsStore useAsyncAction setup for modifyQuestion should pass an async function calling repository.modify as action to useAsyncAction when created.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'question-id-123', …(1) ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question/questions.store.ts:87:5
     isError: isModifyingQuestionError,
   } = useAsyncAction(
     async(id: string, dto: QuestionModificationDto) => repository.modify(id, dto),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantModify")),
+    () => undefined,
   );
 
killedBy: useQuestionsStore useAsyncAction setup for modifyQuestion should call handleGoatItApiError with the error and cantModify translation key when the modifyQuestion error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: modify failed, …(1) ]

Number of calls: 0

[Killed] BlockStatement
stores/domain/question/questions.store.ts:90:92
     (thrownError: unknown) => handleGoatItApiError(thrownError, t("questions.cantModify")),
   );
 
-  async function fetchAndStoreQuestions(query?: AdminFindQuestionsQueryDto): Promise<void> {
-    const fetchedQuestions = await fetchQuestions(query);
-    if (fetchedQuestions) {
-      questions.value = fetchedQuestions;
-    }
-  }
+  async function fetchAndStoreQuestions(query?: AdminFindQuestionsQueryDto): Promise<void> {}
 
   async function createAndStoreQuestion(creationDto: QuestionCreationDto): Promise<void> {
killedBy: useQuestionsStore fetchAndStoreQuestions should call fetchQuestions without query when called without params.
statusReason: expected "vi.fn()" to be called once with arguments: [ undefined ]

Number of calls: 0

[Killed] BlockStatement
stores/domain/question/questions.store.ts:92:27
 
   async function fetchAndStoreQuestions(query?: AdminFindQuestionsQueryDto): Promise<void> {
     const fetchedQuestions = await fetchQuestions(query);
-    if (fetchedQuestions) {
-      questions.value = fetchedQuestions;
-    }
+    if (fetchedQuestions) {}
   }
 
killedBy: useQuestionsStore fetchAndStoreQuestions should update questions with the fetched questions when fetchQuestions resolves with data.
statusReason: expected [] to strictly equal [ { …(10) }, { …(10) } ]

[Killed] ConditionalExpression
stores/domain/question/questions.store.ts:92:9
 
   async function fetchAndStoreQuestions(query?: AdminFindQuestionsQueryDto): Promise<void> {
     const fetchedQuestions = await fetchQuestions(query);
-    if (fetchedQuestions) {
+    if (false) {
       questions.value = fetchedQuestions;
     }
killedBy: useQuestionsStore fetchAndStoreQuestions should update questions with the fetched questions when fetchQuestions resolves with data.
statusReason: expected [] to strictly equal [ { …(10) }, { …(10) } ]

[Killed] BlockStatement
stores/domain/question/questions.store.ts:97:90
     }
   }
 
-  async function createAndStoreQuestion(creationDto: QuestionCreationDto): Promise<void> {
-    const createdQuestion = await createQuestion(creationDto);
-    if (createdQuestion) {
-      questions.value.unshift(createdQuestion);
-      addSuccessToast({ description: t("questions.createSuccessfully"), id: "question-create-success" });
-    }
-  }
+  async function createAndStoreQuestion(creationDto: QuestionCreationDto): Promise<void> {}
 
   async function archiveAndStoreQuestion(id: string): Promise<void> {
killedBy: useQuestionsStore createAndStoreQuestion should call the create execute function with the creation dto when invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ { category: 'trivia', …(5) } ]

Number of calls: 0

[Killed] BlockStatement
stores/domain/question/questions.store.ts:99:26
 
   async function createAndStoreQuestion(creationDto: QuestionCreationDto): Promise<void> {
     const createdQuestion = await createQuestion(creationDto);
-    if (createdQuestion) {
-      questions.value.unshift(createdQuestion);
-      addSuccessToast({ description: t("questions.createSuccessfully"), id: "question-create-success" });
-    }
+    if (createdQuestion) {}
   }
 
killedBy: useQuestionsStore createAndStoreQuestion should unshift the created question when creation resolves with a question.
statusReason: expected [] to strictly equal [ { …(10) } ]

[Killed] ConditionalExpression
stores/domain/question/questions.store.ts:99:9
 
   async function createAndStoreQuestion(creationDto: QuestionCreationDto): Promise<void> {
     const createdQuestion = await createQuestion(creationDto);
-    if (createdQuestion) {
+    if (true) {
       questions.value.unshift(createdQuestion);
       addSuccessToast({ description: t("questions.createSuccessfully"), id: "question-create-success" });
killedBy: useQuestionsStore createAndStoreQuestion should not update questions when creation resolves with undefined.
statusReason: expected [ undefined ] to strictly equal []

[Killed] BlockStatement
stores/domain/question/questions.store.ts:105:69
     }
   }
 
-  async function archiveAndStoreQuestion(id: string): Promise<void> {
-    const archivedQuestion = await archiveQuestion(id);
-    if (!archivedQuestion) {
-      return;
-    }
-    questions.value = replaceInArrayById(questions.value, id, archivedQuestion);
-    addSuccessToast({ description: t("questions.archiveSuccessfully"), id: "question-archive-success" });
-  }
+  async function archiveAndStoreQuestion(id: string): Promise<void> {}
 
   async function assignThemeAndStoreQuestion(id: string, dto: QuestionThemeAssignmentCreationDto): Promise<void> {
killedBy: useQuestionsStore archiveAndStoreQuestion should call the archive execute function with the id when invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'question-id-123' ]

Number of calls: 0

[Killed] BlockStatement
stores/domain/question/questions.store.ts:107:28
 
   async function archiveAndStoreQuestion(id: string): Promise<void> {
     const archivedQuestion = await archiveQuestion(id);
-    if (!archivedQuestion) {
-      return;
-    }
+    if (!archivedQuestion) {}
     questions.value = replaceInArrayById(questions.value, id, archivedQuestion);
     addSuccessToast({ description: t("questions.archiveSuccessfully"), id: "question-archive-success" });
killedBy: useQuestionsStore archiveAndStoreQuestion should not update questions when archive resolves with undefined.
statusReason: expected [ undefined ] to strictly equal [ { id: 'question-id-123', …(9) } ]

[Killed] BooleanLiteral
stores/domain/question/questions.store.ts:107:9
 
   async function archiveAndStoreQuestion(id: string): Promise<void> {
     const archivedQuestion = await archiveQuestion(id);
-    if (!archivedQuestion) {
+    if (archivedQuestion) {
       return;
     }
killedBy: useQuestionsStore archiveAndStoreQuestion should replace the question in the array when archive resolves with the updated question.
statusReason: expected [ { id: 'other-id', …(9) }, …(1) ] to strictly equal [ { id: 'other-id', …(9) }, …(1) ]

[Killed] StringLiteral
stores/domain/question/questions.store.ts:111:38
       return;
     }
     questions.value = replaceInArrayById(questions.value, id, archivedQuestion);
-    addSuccessToast({ description: t("questions.archiveSuccessfully"), id: "question-archive-success" });
+    addSuccessToast({ description: t(""), id: "question-archive-success" });
   }
 
killedBy: useQuestionsStore archiveAndStoreQuestion should add success toast when archive resolves with the updated question.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
stores/domain/question/questions.store.ts:114:114
     addSuccessToast({ description: t("questions.archiveSuccessfully"), id: "question-archive-success" });
   }
 
-  async function assignThemeAndStoreQuestion(id: string, dto: QuestionThemeAssignmentCreationDto): Promise<void> {
-    const updatedQuestion = await assignThemeToQuestion(id, dto);
-    if (!updatedQuestion) {
-      return;
-    }
-    questions.value = replaceInArrayById(questions.value, id, updatedQuestion);
-    addSuccessToast({ description: t("questions.assignThemeSuccessfully"), id: "question-assign-theme-success" });
-  }
+  async function assignThemeAndStoreQuestion(id: string, dto: QuestionThemeAssignmentCreationDto): Promise<void> {}
 
   async function removeThemeAndStoreQuestion(id: string, themeId: string): Promise<void> {
killedBy: useQuestionsStore assignThemeAndStoreQuestion should call the assignTheme execute function with the id and dto when invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'question-id-123', { …(3) } ]

Number of calls: 0

[Killed] BlockStatement
stores/domain/question/questions.store.ts:116:27
 
   async function assignThemeAndStoreQuestion(id: string, dto: QuestionThemeAssignmentCreationDto): Promise<void> {
     const updatedQuestion = await assignThemeToQuestion(id, dto);
-    if (!updatedQuestion) {
-      return;
-    }
+    if (!updatedQuestion) {}
     questions.value = replaceInArrayById(questions.value, id, updatedQuestion);
     addSuccessToast({ description: t("questions.assignThemeSuccessfully"), id: "question-assign-theme-success" });
killedBy: useQuestionsStore assignThemeAndStoreQuestion should not update questions when assignTheme resolves with undefined.
statusReason: expected [ undefined ] to strictly equal [ { id: 'question-id-123', …(9) } ]

[Killed] BooleanLiteral
stores/domain/question/questions.store.ts:116:9
 
   async function assignThemeAndStoreQuestion(id: string, dto: QuestionThemeAssignmentCreationDto): Promise<void> {
     const updatedQuestion = await assignThemeToQuestion(id, dto);
-    if (!updatedQuestion) {
+    if (updatedQuestion) {
       return;
     }
killedBy: useQuestionsStore assignThemeAndStoreQuestion should replace the question in the array when assignTheme resolves with the updated question.
statusReason: expected [ { id: 'other-id', …(9) }, …(1) ] to strictly equal [ { id: 'other-id', …(9) }, …(1) ]

[Killed] ObjectLiteral
stores/domain/question/questions.store.ts:120:21
       return;
     }
     questions.value = replaceInArrayById(questions.value, id, updatedQuestion);
-    addSuccessToast({ description: t("questions.assignThemeSuccessfully"), id: "question-assign-theme-success" });
+    addSuccessToast({});
   }
 
killedBy: useQuestionsStore assignThemeAndStoreQuestion should add success toast when assignTheme resolves with the updated question.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(2) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
stores/domain/question/questions.store.ts:123:90
     addSuccessToast({ description: t("questions.assignThemeSuccessfully"), id: "question-assign-theme-success" });
   }
 
-  async function removeThemeAndStoreQuestion(id: string, themeId: string): Promise<void> {
-    const updatedQuestion = await removeThemeFromQuestion(id, themeId);
-    if (!updatedQuestion) {
-      return;
-    }
-    questions.value = replaceInArrayById(questions.value, id, updatedQuestion);
-    addSuccessToast({ description: t("questions.removeThemeSuccessfully"), id: "question-remove-theme-success" });
-  }
+  async function removeThemeAndStoreQuestion(id: string, themeId: string): Promise<void> {}
 
   async function modifyThemeAssignmentAndStoreQuestion(id: string, themeId: string, dto: QuestionThemeAssignmentModificationDto): Promise<void> {
killedBy: useQuestionsStore removeThemeAndStoreQuestion should call the removeTheme execute function with the id and themeId when invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'question-id-123', 'theme-id-456' ]

Number of calls: 0

[Killed] BlockStatement
stores/domain/question/questions.store.ts:125:27
 
   async function removeThemeAndStoreQuestion(id: string, themeId: string): Promise<void> {
     const updatedQuestion = await removeThemeFromQuestion(id, themeId);
-    if (!updatedQuestion) {
-      return;
-    }
+    if (!updatedQuestion) {}
     questions.value = replaceInArrayById(questions.value, id, updatedQuestion);
     addSuccessToast({ description: t("questions.removeThemeSuccessfully"), id: "question-remove-theme-success" });
killedBy: useQuestionsStore removeThemeAndStoreQuestion should not update questions when removeTheme resolves with undefined.
statusReason: expected [ undefined ] to strictly equal [ { id: 'question-id-123', …(9) } ]

[Killed] BooleanLiteral
stores/domain/question/questions.store.ts:125:9
 
   async function removeThemeAndStoreQuestion(id: string, themeId: string): Promise<void> {
     const updatedQuestion = await removeThemeFromQuestion(id, themeId);
-    if (!updatedQuestion) {
+    if (updatedQuestion) {
       return;
     }
killedBy: useQuestionsStore removeThemeAndStoreQuestion should replace the question in the array when removeTheme resolves with the updated question.
statusReason: expected [ { id: 'other-id', …(9) }, …(1) ] to strictly equal [ { id: 'other-id', …(9) }, …(1) ]

[Killed] StringLiteral
stores/domain/question/questions.store.ts:129:80
       return;
     }
     questions.value = replaceInArrayById(questions.value, id, updatedQuestion);
-    addSuccessToast({ description: t("questions.removeThemeSuccessfully"), id: "question-remove-theme-success" });
+    addSuccessToast({ description: t("questions.removeThemeSuccessfully"), id: "" });
   }
 
killedBy: useQuestionsStore removeThemeAndStoreQuestion should add success toast when removeTheme resolves with the updated question.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
stores/domain/question/questions.store.ts:132:145
     addSuccessToast({ description: t("questions.removeThemeSuccessfully"), id: "question-remove-theme-success" });
   }
 
-  async function modifyThemeAssignmentAndStoreQuestion(id: string, themeId: string, dto: QuestionThemeAssignmentModificationDto): Promise<void> {
-    const updatedQuestion = await modifyQuestionThemeAssignment(id, themeId, dto);
-    if (!updatedQuestion) {
-      return;
-    }
-    questions.value = replaceInArrayById(questions.value, id, updatedQuestion);
-    addSuccessToast({ description: t("questions.modifyThemeAssignmentSuccessfully"), id: "question-modify-theme-assignment-success" });
-  }
+  async function modifyThemeAssignmentAndStoreQuestion(id: string, themeId: string, dto: QuestionThemeAssignmentModificationDto): Promise<void> {}
 
   async function modifyAndStoreQuestion(id: string, dto: QuestionModificationDto): Promise<void> {
killedBy: useQuestionsStore modifyThemeAssignmentAndStoreQuestion should call the modifyThemeAssignment execute function with the id, themeId and dto when invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'question-id-123', …(2) ]

Number of calls: 0

[Killed] BlockStatement
stores/domain/question/questions.store.ts:134:27
 
   async function modifyThemeAssignmentAndStoreQuestion(id: string, themeId: string, dto: QuestionThemeAssignmentModificationDto): Promise<void> {
     const updatedQuestion = await modifyQuestionThemeAssignment(id, themeId, dto);
-    if (!updatedQuestion) {
-      return;
-    }
+    if (!updatedQuestion) {}
     questions.value = replaceInArrayById(questions.value, id, updatedQuestion);
     addSuccessToast({ description: t("questions.modifyThemeAssignmentSuccessfully"), id: "question-modify-theme-assignment-success" });
killedBy: useQuestionsStore modifyThemeAssignmentAndStoreQuestion should not update questions when modifyThemeAssignment resolves with undefined.
statusReason: expected [ undefined ] to strictly equal [ { id: 'question-id-123', …(9) } ]

[Killed] ConditionalExpression
stores/domain/question/questions.store.ts:134:9
 
   async function modifyThemeAssignmentAndStoreQuestion(id: string, themeId: string, dto: QuestionThemeAssignmentModificationDto): Promise<void> {
     const updatedQuestion = await modifyQuestionThemeAssignment(id, themeId, dto);
-    if (!updatedQuestion) {
+    if (true) {
       return;
     }
killedBy: useQuestionsStore modifyThemeAssignmentAndStoreQuestion should replace the question in the array when modifyThemeAssignment resolves with the updated question.
statusReason: expected [ { id: 'other-id', …(9) }, …(1) ] to strictly equal [ { id: 'other-id', …(9) }, …(1) ]

[Killed] ObjectLiteral
stores/domain/question/questions.store.ts:138:21
       return;
     }
     questions.value = replaceInArrayById(questions.value, id, updatedQuestion);
-    addSuccessToast({ description: t("questions.modifyThemeAssignmentSuccessfully"), id: "question-modify-theme-assignment-success" });
+    addSuccessToast({});
   }
 
killedBy: useQuestionsStore modifyThemeAssignmentAndStoreQuestion should add success toast when modifyThemeAssignment resolves with the updated question.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(2) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] StringLiteral
stores/domain/question/questions.store.ts:138:38
       return;
     }
     questions.value = replaceInArrayById(questions.value, id, updatedQuestion);
-    addSuccessToast({ description: t("questions.modifyThemeAssignmentSuccessfully"), id: "question-modify-theme-assignment-success" });
+    addSuccessToast({ description: t(""), id: "question-modify-theme-assignment-success" });
   }
 
killedBy: useQuestionsStore modifyThemeAssignmentAndStoreQuestion should add success toast when modifyThemeAssignment resolves with the updated question.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
stores/domain/question/questions.store.ts:141:98
     addSuccessToast({ description: t("questions.modifyThemeAssignmentSuccessfully"), id: "question-modify-theme-assignment-success" });
   }
 
-  async function modifyAndStoreQuestion(id: string, dto: QuestionModificationDto): Promise<void> {
-    const modifiedQuestion = await modifyQuestion(id, dto);
-    if (!modifiedQuestion) {
-      return;
-    }
-    questions.value = replaceInArrayById(questions.value, id, modifiedQuestion);
-    addSuccessToast({ description: t("questions.modifySuccessfully"), id: "question-modify-success" });
-  }
+  async function modifyAndStoreQuestion(id: string, dto: QuestionModificationDto): Promise<void> {}
   return {
     questions,
killedBy: useQuestionsStore modifyAndStoreQuestion should call the modifyQuestion execute function with the id and dto when invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'question-id-123', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
stores/domain/question/questions.store.ts:143:9
 
   async function modifyAndStoreQuestion(id: string, dto: QuestionModificationDto): Promise<void> {
     const modifiedQuestion = await modifyQuestion(id, dto);
-    if (!modifiedQuestion) {
+    if (true) {
       return;
     }
killedBy: useQuestionsStore modifyAndStoreQuestion should replace the question in the array when modifyQuestion resolves with the updated question.
statusReason: expected [ { id: 'other-id', …(9) }, …(1) ] to strictly equal [ { id: 'other-id', …(9) }, …(1) ]

[Killed] BlockStatement
stores/domain/question/questions.store.ts:143:28
 
   async function modifyAndStoreQuestion(id: string, dto: QuestionModificationDto): Promise<void> {
     const modifiedQuestion = await modifyQuestion(id, dto);
-    if (!modifiedQuestion) {
-      return;
-    }
+    if (!modifiedQuestion) {}
     questions.value = replaceInArrayById(questions.value, id, modifiedQuestion);
     addSuccessToast({ description: t("questions.modifySuccessfully"), id: "question-modify-success" });
killedBy: useQuestionsStore modifyAndStoreQuestion should not update questions when modifyQuestion resolves with undefined.
statusReason: expected [ undefined ] to strictly equal [ { id: 'question-id-123', …(9) } ]
