[Killed] ArrowFunction
stores/domain/question-theme/question-themes.store.ts:7:49
 
 export const useQuestionThemesStore = defineStore(StoreNames.QUESTION_THEMES, () => {
   const questionThemes = ref<QuestionTheme[]>([]);
-  const questionThemeSlugs = computed<string[]>(() => questionThemes.value.map(theme => theme.slug));
+  const questionThemeSlugs = computed<string[]>(() => undefined);
 
   const repository = questionThemesRepository($fetch);
killedBy: useQuestionThemesStore questionThemeSlugs should return an empty array when there are no question themes.
statusReason: expected undefined to strictly equal []

[Killed] ArrowFunction
stores/domain/question-theme/question-themes.store.ts:7:80
 
 export const useQuestionThemesStore = defineStore(StoreNames.QUESTION_THEMES, () => {
   const questionThemes = ref<QuestionTheme[]>([]);
-  const questionThemeSlugs = computed<string[]>(() => questionThemes.value.map(theme => theme.slug));
+  const questionThemeSlugs = computed<string[]>(() => questionThemes.value.map(() => undefined));
 
   const repository = questionThemesRepository($fetch);
killedBy: useQuestionThemesStore questionThemeSlugs should return the slugs of all question themes when there are themes.
statusReason: expected [ undefined, undefined ] to strictly equal [ 'theme-one', 'theme-two' ]

[Killed] ArrowFunction
stores/domain/question-theme/question-themes.store.ts:22:5
     isError: isFetchingQuestionThemesError,
   } = useAsyncAction(
     repository.getAll,
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questionThemes.cantFetch")),
+    () => undefined,
   );
 
killedBy: useQuestionThemesStore useAsyncAction setup for fetch should call handleGoatItApiError with the error and cantFetch translation key when the fetch error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: fetch failed, …(1) ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question-theme/question-themes.store.ts:32:5
     isSuccess: isCreateQuestionThemeSuccess,
     isError: isCreatingQuestionThemeError,
   } = useAsyncAction(
-    async(creationDto: QuestionThemeCreationDto) => repository.create(creationDto),
+    () => undefined,
     (thrownError: unknown) => handleGoatItApiError(thrownError, t("questionThemes.cantCreate")),
   );
killedBy: useQuestionThemesStore useAsyncAction setup for create should pass an async function calling repository.create as action to useAsyncAction when created.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(5) } ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question-theme/question-themes.store.ts:33:5
     isError: isCreatingQuestionThemeError,
   } = useAsyncAction(
     async(creationDto: QuestionThemeCreationDto) => repository.create(creationDto),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questionThemes.cantCreate")),
+    () => undefined,
   );
 
killedBy: useQuestionThemesStore useAsyncAction setup for create should call handleGoatItApiError with the error and cantCreate translation key when the create error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: create failed, …(1) ]

Number of calls: 0

[Killed] StringLiteral
stores/domain/question-theme/question-themes.store.ts:33:67
     isError: isCreatingQuestionThemeError,
   } = useAsyncAction(
     async(creationDto: QuestionThemeCreationDto) => repository.create(creationDto),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questionThemes.cantCreate")),
+    (thrownError: unknown) => handleGoatItApiError(thrownError, t("")),
   );
 
killedBy: useQuestionThemesStore useAsyncAction setup for create should call handleGoatItApiError with the error and cantCreate translation key when the create error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: create failed, …(1) ]

Received:

  1st vi.fn() call:

  [
    Error {

[Killed] ArrowFunction
stores/domain/question-theme/question-themes.store.ts:44:5
     isError: isArchivingQuestionThemeError,
   } = useAsyncAction(
     async(id: string) => repository.archive(id),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questionThemes.cantArchive")),
+    () => undefined,
   );
 
killedBy: useQuestionThemesStore useAsyncAction setup for archive should call handleGoatItApiError with the error and cantArchive translation key when the archive error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: archive failed, …(1) ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question-theme/question-themes.store.ts:54:5
     isSuccess: isModifyQuestionThemeSuccess,
     isError: isModifyingQuestionThemeError,
   } = useAsyncAction(
-    async(id: string, modificationDto: QuestionThemeModificationDto) => repository.patch(id, modificationDto),
+    () => undefined,
     (thrownError: unknown) => handleGoatItApiError(thrownError, t("questionThemes.cantModify")),
   );
killedBy: useQuestionThemesStore useAsyncAction setup for modify should pass an async function calling repository.patch as action to useAsyncAction when created.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'theme-id-123', { …(5) } ]

Number of calls: 0

[Killed] ArrowFunction
stores/domain/question-theme/question-themes.store.ts:55:5
     isError: isModifyingQuestionThemeError,
   } = useAsyncAction(
     async(id: string, modificationDto: QuestionThemeModificationDto) => repository.patch(id, modificationDto),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questionThemes.cantModify")),
+    () => undefined,
   );
 
killedBy: useQuestionThemesStore useAsyncAction setup for modify should call handleGoatItApiError with the error and cantModify translation key when the modify error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: modify failed, …(1) ]

Number of calls: 0

[Killed] StringLiteral
stores/domain/question-theme/question-themes.store.ts:55:67
     isError: isModifyingQuestionThemeError,
   } = useAsyncAction(
     async(id: string, modificationDto: QuestionThemeModificationDto) => repository.patch(id, modificationDto),
-    (thrownError: unknown) => handleGoatItApiError(thrownError, t("questionThemes.cantModify")),
+    (thrownError: unknown) => handleGoatItApiError(thrownError, t("")),
   );
 
killedBy: useQuestionThemesStore useAsyncAction setup for modify should call handleGoatItApiError with the error and cantModify translation key when the modify error callback is invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: modify failed, …(1) ]

Received:

  1st vi.fn() call:

  [
    Error {

[Killed] BlockStatement
stores/domain/question-theme/question-themes.store.ts:58:102
     (thrownError: unknown) => handleGoatItApiError(thrownError, t("questionThemes.cantModify")),
   );
 
-  async function fetchAndStoreQuestionThemes(query?: AdminFindQuestionThemesQueryDto): Promise<void> {
-    const fetchedQuestionThemes = await fetchQuestionThemes(query);
-    if (fetchedQuestionThemes) {
-      questionThemes.value = fetchedQuestionThemes;
-    }
-  }
+  async function fetchAndStoreQuestionThemes(query?: AdminFindQuestionThemesQueryDto): Promise<void> {}
 
   async function createAndStoreQuestionTheme(creationDto: QuestionThemeCreationDto): Promise<void> {
killedBy: useQuestionThemesStore fetchAndStoreQuestionThemes should call fetchQuestionThemes without query when called without params.
statusReason: expected "vi.fn()" to be called once with arguments: [ undefined ]

Number of calls: 0

[Killed] BlockStatement
stores/domain/question-theme/question-themes.store.ts:60:32
 
   async function fetchAndStoreQuestionThemes(query?: AdminFindQuestionThemesQueryDto): Promise<void> {
     const fetchedQuestionThemes = await fetchQuestionThemes(query);
-    if (fetchedQuestionThemes) {
-      questionThemes.value = fetchedQuestionThemes;
-    }
+    if (fetchedQuestionThemes) {}
   }
 
killedBy: useQuestionThemesStore fetchAndStoreQuestionThemes should update questionThemes with the fetched themes when fetchQuestionThemes resolves with data.
statusReason: expected [] to strictly equal [ { …(9) }, { …(9) } ]

[Killed] ConditionalExpression
stores/domain/question-theme/question-themes.store.ts:60:9
 
   async function fetchAndStoreQuestionThemes(query?: AdminFindQuestionThemesQueryDto): Promise<void> {
     const fetchedQuestionThemes = await fetchQuestionThemes(query);
-    if (fetchedQuestionThemes) {
+    if (true) {
       questionThemes.value = fetchedQuestionThemes;
     }
killedBy: useQuestionThemesStore fetchAndStoreQuestionThemes should not update questionThemes when fetchQuestionThemes resolves with undefined.
statusReason: expected undefined to strictly equal []

[Killed] BlockStatement
stores/domain/question-theme/question-themes.store.ts:65:100
     }
   }
 
-  async function createAndStoreQuestionTheme(creationDto: QuestionThemeCreationDto): Promise<void> {
-    const createdQuestionTheme = await createQuestionTheme(creationDto);
-    if (createdQuestionTheme) {
-      questionThemes.value.unshift(createdQuestionTheme);
-      addSuccessToast({ description: t("questionThemes.createSuccessfully"), id: "question-theme-create-success" });
-    }
-  }
+  async function createAndStoreQuestionTheme(creationDto: QuestionThemeCreationDto): Promise<void> {}
 
   async function archiveAndStoreQuestionTheme(id: string): Promise<void> {
killedBy: useQuestionThemesStore createAndStoreQuestionTheme should call the create execute function with the creation dto when invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ { slug: 'traho-pecus-umbra', …(4) } ]

Number of calls: 0

[Killed] ConditionalExpression
stores/domain/question-theme/question-themes.store.ts:67:9
 
   async function createAndStoreQuestionTheme(creationDto: QuestionThemeCreationDto): Promise<void> {
     const createdQuestionTheme = await createQuestionTheme(creationDto);
-    if (createdQuestionTheme) {
+    if (true) {
       questionThemes.value.unshift(createdQuestionTheme);
       addSuccessToast({ description: t("questionThemes.createSuccessfully"), id: "question-theme-create-success" });
killedBy: useQuestionThemesStore createAndStoreQuestionTheme should not update questionThemes when creation resolves with undefined.
statusReason: expected [ undefined ] to strictly equal []

[Killed] ConditionalExpression
stores/domain/question-theme/question-themes.store.ts:67:9
 
   async function createAndStoreQuestionTheme(creationDto: QuestionThemeCreationDto): Promise<void> {
     const createdQuestionTheme = await createQuestionTheme(creationDto);
-    if (createdQuestionTheme) {
+    if (false) {
       questionThemes.value.unshift(createdQuestionTheme);
       addSuccessToast({ description: t("questionThemes.createSuccessfully"), id: "question-theme-create-success" });
killedBy: useQuestionThemesStore createAndStoreQuestionTheme should unshift the created theme when creation resolves with a theme.
statusReason: expected [] to strictly equal [ { …(9) } ]

[Killed] ObjectLiteral
stores/domain/question-theme/question-themes.store.ts:69:23
     const createdQuestionTheme = await createQuestionTheme(creationDto);
     if (createdQuestionTheme) {
       questionThemes.value.unshift(createdQuestionTheme);
-      addSuccessToast({ description: t("questionThemes.createSuccessfully"), id: "question-theme-create-success" });
+      addSuccessToast({});
     }
   }
killedBy: useQuestionThemesStore createAndStoreQuestionTheme should add success toast when creation resolves with a theme.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(2) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] StringLiteral
stores/domain/question-theme/question-themes.store.ts:69:40
     const createdQuestionTheme = await createQuestionTheme(creationDto);
     if (createdQuestionTheme) {
       questionThemes.value.unshift(createdQuestionTheme);
-      addSuccessToast({ description: t("questionThemes.createSuccessfully"), id: "question-theme-create-success" });
+      addSuccessToast({ description: t(""), id: "question-theme-create-success" });
     }
   }
killedBy: useQuestionThemesStore createAndStoreQuestionTheme should add success toast when creation resolves with a theme.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
stores/domain/question-theme/question-themes.store.ts:73:74
     }
   }
 
-  async function archiveAndStoreQuestionTheme(id: string): Promise<void> {
-    const archivedQuestionTheme = await archiveQuestionTheme(id);
-    if (!archivedQuestionTheme) {
-      return;
-    }
-    questionThemes.value = replaceInArrayById(questionThemes.value, id, archivedQuestionTheme);
-    addSuccessToast({ description: t("questionThemes.archiveSuccessfully"), id: "question-theme-archive-success" });
-  }
+  async function archiveAndStoreQuestionTheme(id: string): Promise<void> {}
 
   async function modifyAndStoreQuestionTheme(id: string, modificationDto: QuestionThemeModificationDto): Promise<void> {
killedBy: useQuestionThemesStore archiveAndStoreQuestionTheme should call the archive execute function with the id when invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'theme-id-123' ]

Number of calls: 0

[Killed] ConditionalExpression
stores/domain/question-theme/question-themes.store.ts:75:9
 
   async function archiveAndStoreQuestionTheme(id: string): Promise<void> {
     const archivedQuestionTheme = await archiveQuestionTheme(id);
-    if (!archivedQuestionTheme) {
+    if (true) {
       return;
     }
killedBy: useQuestionThemesStore archiveAndStoreQuestionTheme should replace the theme in the array when archive resolves with the updated theme.
statusReason: expected [ { id: 'other-id', …(8) }, …(1) ] to strictly equal [ { id: 'other-id', …(8) }, …(1) ]

[Killed] BooleanLiteral
stores/domain/question-theme/question-themes.store.ts:75:9
 
   async function archiveAndStoreQuestionTheme(id: string): Promise<void> {
     const archivedQuestionTheme = await archiveQuestionTheme(id);
-    if (!archivedQuestionTheme) {
+    if (archivedQuestionTheme) {
       return;
     }
killedBy: useQuestionThemesStore archiveAndStoreQuestionTheme should replace the theme in the array when archive resolves with the updated theme.
statusReason: expected [ { id: 'other-id', …(8) }, …(1) ] to strictly equal [ { id: 'other-id', …(8) }, …(1) ]

[Killed] StringLiteral
stores/domain/question-theme/question-themes.store.ts:79:38
       return;
     }
     questionThemes.value = replaceInArrayById(questionThemes.value, id, archivedQuestionTheme);
-    addSuccessToast({ description: t("questionThemes.archiveSuccessfully"), id: "question-theme-archive-success" });
+    addSuccessToast({ description: t(""), id: "question-theme-archive-success" });
   }
 
killedBy: useQuestionThemesStore archiveAndStoreQuestionTheme should add success toast when archive resolves with the updated theme.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
stores/domain/question-theme/question-themes.store.ts:82:120
     addSuccessToast({ description: t("questionThemes.archiveSuccessfully"), id: "question-theme-archive-success" });
   }
 
-  async function modifyAndStoreQuestionTheme(id: string, modificationDto: QuestionThemeModificationDto): Promise<void> {
-    const modifiedQuestionTheme = await modifyQuestionTheme(id, modificationDto);
-    if (!modifiedQuestionTheme) {
-      return;
-    }
-    questionThemes.value = replaceInArrayById(questionThemes.value, id, modifiedQuestionTheme);
-    addSuccessToast({ description: t("questionThemes.modifySuccessfully"), id: "question-theme-modify-success" });
-  }
+  async function modifyAndStoreQuestionTheme(id: string, modificationDto: QuestionThemeModificationDto): Promise<void> {}
   return {
     questionThemes,
killedBy: useQuestionThemesStore modifyAndStoreQuestionTheme should call the modify execute function with the id and the modification dto when invoked.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'theme-id-123', { …(5) } ]

Number of calls: 0

[Killed] BooleanLiteral
stores/domain/question-theme/question-themes.store.ts:84:9
 
   async function modifyAndStoreQuestionTheme(id: string, modificationDto: QuestionThemeModificationDto): Promise<void> {
     const modifiedQuestionTheme = await modifyQuestionTheme(id, modificationDto);
-    if (!modifiedQuestionTheme) {
+    if (modifiedQuestionTheme) {
       return;
     }
killedBy: useQuestionThemesStore modifyAndStoreQuestionTheme should replace the theme in the array when modify resolves with the updated theme.
statusReason: expected [ { id: 'other-id', …(8) }, …(1) ] to strictly equal [ { id: 'other-id', …(8) }, …(1) ]

[Killed] ConditionalExpression
stores/domain/question-theme/question-themes.store.ts:84:9
 
   async function modifyAndStoreQuestionTheme(id: string, modificationDto: QuestionThemeModificationDto): Promise<void> {
     const modifiedQuestionTheme = await modifyQuestionTheme(id, modificationDto);
-    if (!modifiedQuestionTheme) {
+    if (true) {
       return;
     }
killedBy: useQuestionThemesStore modifyAndStoreQuestionTheme should replace the theme in the array when modify resolves with the updated theme.
statusReason: expected [ { id: 'other-id', …(8) }, …(1) ] to strictly equal [ { id: 'other-id', …(8) }, …(1) ]

[Killed] ObjectLiteral
stores/domain/question-theme/question-themes.store.ts:88:21
       return;
     }
     questionThemes.value = replaceInArrayById(questionThemes.value, id, modifiedQuestionTheme);
-    addSuccessToast({ description: t("questionThemes.modifySuccessfully"), id: "question-theme-modify-success" });
+    addSuccessToast({});
   }
   return {
killedBy: useQuestionThemesStore modifyAndStoreQuestionTheme should add success toast when modify resolves with the updated theme.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(2) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ObjectLiteral
stores/domain/question-theme/question-themes.store.ts:90:10
     questionThemes.value = replaceInArrayById(questionThemes.value, id, modifiedQuestionTheme);
     addSuccessToast({ description: t("questionThemes.modifySuccessfully"), id: "question-theme-modify-success" });
   }
-  return {
-    questionThemes,
-    questionThemeSlugs,
-    fetchQuestionThemesStatus,
-    isFetchingQuestionThemes,
-    isFetchQuestionThemesSuccess,
-    isFetchingQuestionThemesError,
-    fetchQuestionThemes,
-    fetchAndStoreQuestionThemes,
-    createQuestionThemeStatus,
-    isCreatingQuestionTheme,
-    isCreateQuestionThemeSuccess,
-    isCreatingQuestionThemeError,
-    createAndStoreQuestionTheme,
-    archiveQuestionThemeStatus,
-    isArchivingQuestionTheme,
-    isArchiveQuestionThemeSuccess,
-    isArchivingQuestionThemeError,
-    archiveAndStoreQuestionTheme,
-    modifyQuestionThemeStatus,
-    isModifyingQuestionTheme,
-    isModifyQuestionThemeSuccess,
-    isModifyingQuestionThemeError,
-    modifyAndStoreQuestionTheme,
-  };
+  return {};
 });
killedBy: useQuestionThemesStore questionThemes should expose an empty array as initial state when created.
statusReason: expected undefined to strictly equal []
