[Killed] BlockStatement
utils/helpers/color/color.helpers.ts:15:39
   MAX_RGB_VALUE,
 } from "~/utils/helpers/color/color.helpers.constants";
 
-function toHex(value: number): string {
-  return Math.min(MAX_RGB_VALUE, Math.max(0, Math.round(value))).toString(HEX_RADIX).padStart(HEX_PAD_LENGTH, "0");
-}
+function toHex(value: number): string {}
 
 function parseHexToRgb(hex: string): RgbColor {
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected '#undefinedundefinedundefined' to be '#cc0000' // Object.is equality

[Killed] MethodExpression
utils/helpers/color/color.helpers.ts:16:10
 } from "~/utils/helpers/color/color.helpers.constants";
 
 function toHex(value: number): string {
-  return Math.min(MAX_RGB_VALUE, Math.max(0, Math.round(value))).toString(HEX_RADIX).padStart(HEX_PAD_LENGTH, "0");
+  return Math.max(MAX_RGB_VALUE, Math.max(0, Math.round(value))).toString(HEX_RADIX).padStart(HEX_PAD_LENGTH, "0");
 }
 
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected '#ffffff' to be '#cc0000' // Object.is equality

[Killed] MethodExpression
utils/helpers/color/color.helpers.ts:16:34
 } from "~/utils/helpers/color/color.helpers.constants";
 
 function toHex(value: number): string {
-  return Math.min(MAX_RGB_VALUE, Math.max(0, Math.round(value))).toString(HEX_RADIX).padStart(HEX_PAD_LENGTH, "0");
+  return Math.min(MAX_RGB_VALUE, Math.min(0, Math.round(value))).toString(HEX_RADIX).padStart(HEX_PAD_LENGTH, "0");
 }
 
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected '#000000' to be '#cc0000' // Object.is equality

[Killed] BlockStatement
utils/helpers/color/color.helpers.ts:19:47
   return Math.min(MAX_RGB_VALUE, Math.max(0, Math.round(value))).toString(HEX_RADIX).padStart(HEX_PAD_LENGTH, "0");
 }
 
-function parseHexToRgb(hex: string): RgbColor {
-  const sanitized = hex.replace("#", "");
-
-  if (!HEX_COLOR_PATTERN.test(sanitized)) {
-    throw new Error(`Invalid hex color: ${hex}`);
-  }
-  return {
-    red: Number.parseInt(sanitized.slice(HEX_RED_START_INDEX, HEX_RED_END_INDEX), HEX_RADIX),
-    green: Number.parseInt(sanitized.slice(HEX_GREEN_START_INDEX, HEX_GREEN_END_INDEX), HEX_RADIX),
-    blue: Number.parseInt(sanitized.slice(HEX_BLUE_START_INDEX, HEX_BLUE_END_INDEX), HEX_RADIX),
-  };
-}
+function parseHexToRgb(hex: string): RgbColor {}
 
 function rgbToHex(red: number, green: number, blue: number): string {
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: Cannot destructure property 'red' of 'parseHexToRgb(...)' as it is undefined.

[Killed] BlockStatement
utils/helpers/color/color.helpers.ts:22:43
 function parseHexToRgb(hex: string): RgbColor {
   const sanitized = hex.replace("#", "");
 
-  if (!HEX_COLOR_PATTERN.test(sanitized)) {
-    throw new Error(`Invalid hex color: ${hex}`);
-  }
+  if (!HEX_COLOR_PATTERN.test(sanitized)) {}
   return {
     red: Number.parseInt(sanitized.slice(HEX_RED_START_INDEX, HEX_RED_END_INDEX), HEX_RADIX),
killedBy: Color Helpers parseHexToRgb should throw an error when hex is undefined
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
utils/helpers/color/color.helpers.ts:22:7
 function parseHexToRgb(hex: string): RgbColor {
   const sanitized = hex.replace("#", "");
 
-  if (!HEX_COLOR_PATTERN.test(sanitized)) {
+  if (true) {
     throw new Error(`Invalid hex color: ${hex}`);
   }
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: Invalid hex color: #FF0000

[Killed] StringLiteral
utils/helpers/color/color.helpers.ts:23:21
   const sanitized = hex.replace("#", "");
 
   if (!HEX_COLOR_PATTERN.test(sanitized)) {
-    throw new Error(`Invalid hex color: ${hex}`);
+    throw new Error(``);
   }
   return {
killedBy: Color Helpers parseHexToRgb should throw an error when hex is undefined
statusReason: expected [Function] to throw error including 'Invalid hex color: ZZZZZZ' but got ''

[Killed] MethodExpression
utils/helpers/color/color.helpers.ts:26:26
     throw new Error(`Invalid hex color: ${hex}`);
   }
   return {
-    red: Number.parseInt(sanitized.slice(HEX_RED_START_INDEX, HEX_RED_END_INDEX), HEX_RADIX),
+    red: Number.parseInt(sanitized, HEX_RADIX),
     green: Number.parseInt(sanitized.slice(HEX_GREEN_START_INDEX, HEX_GREEN_END_INDEX), HEX_RADIX),
     blue: Number.parseInt(sanitized.slice(HEX_BLUE_START_INDEX, HEX_BLUE_END_INDEX), HEX_RADIX),
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected '#ff0000' to be '#cc0000' // Object.is equality

[Killed] MethodExpression
utils/helpers/color/color.helpers.ts:27:28
   }
   return {
     red: Number.parseInt(sanitized.slice(HEX_RED_START_INDEX, HEX_RED_END_INDEX), HEX_RADIX),
-    green: Number.parseInt(sanitized.slice(HEX_GREEN_START_INDEX, HEX_GREEN_END_INDEX), HEX_RADIX),
+    green: Number.parseInt(sanitized, HEX_RADIX),
     blue: Number.parseInt(sanitized.slice(HEX_BLUE_START_INDEX, HEX_BLUE_END_INDEX), HEX_RADIX),
   };
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected '#ccff00' to be '#cc0000' // Object.is equality

[Killed] MethodExpression
utils/helpers/color/color.helpers.ts:28:27
   return {
     red: Number.parseInt(sanitized.slice(HEX_RED_START_INDEX, HEX_RED_END_INDEX), HEX_RADIX),
     green: Number.parseInt(sanitized.slice(HEX_GREEN_START_INDEX, HEX_GREEN_END_INDEX), HEX_RADIX),
-    blue: Number.parseInt(sanitized.slice(HEX_BLUE_START_INDEX, HEX_BLUE_END_INDEX), HEX_RADIX),
+    blue: Number.parseInt(sanitized, HEX_RADIX),
   };
 }
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected '#cc00ff' to be '#cc0000' // Object.is equality

[Killed] BlockStatement
utils/helpers/color/color.helpers.ts:32:69
   };
 }
 
-function rgbToHex(red: number, green: number, blue: number): string {
-  return `#${toHex(red)}${toHex(green)}${toHex(blue)}`;
-}
+function rgbToHex(red: number, green: number, blue: number): string {}
 
 function darkenHexColor(hex: string, amount: number): string {
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected undefined to be '#cc0000' // Object.is equality

[Killed] StringLiteral
utils/helpers/color/color.helpers.ts:33:10
 }
 
 function rgbToHex(red: number, green: number, blue: number): string {
-  return `#${toHex(red)}${toHex(green)}${toHex(blue)}`;
+  return ``;
 }
 
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected '' to be '#cc0000' // Object.is equality

[Killed] BlockStatement
utils/helpers/color/color.helpers.ts:36:62
   return `#${toHex(red)}${toHex(green)}${toHex(blue)}`;
 }
 
-function darkenHexColor(hex: string, amount: number): string {
-  const { red, green, blue } = parseHexToRgb(hex);
-  const factor = 1 - amount;
-
-  return rgbToHex(
-    red * factor,
-    green * factor,
-    blue * factor,
-  );
-}
+function darkenHexColor(hex: string, amount: number): string {}
 
 function lightenHexColor(hex: string, amount: number): string {
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected undefined to be '#cc0000' // Object.is equality

[Killed] ArithmeticOperator
utils/helpers/color/color.helpers.ts:38:18
 
 function darkenHexColor(hex: string, amount: number): string {
   const { red, green, blue } = parseHexToRgb(hex);
-  const factor = 1 - amount;
+  const factor = 1 + amount;
 
   return rgbToHex(
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected '#ff0000' to be '#cc0000' // Object.is equality

[Killed] ArithmeticOperator
utils/helpers/color/color.helpers.ts:41:5
   const factor = 1 - amount;
 
   return rgbToHex(
-    red * factor,
+    red / factor,
     green * factor,
     blue * factor,
killedBy: useHexColor adaptedColor should return a darkened color when color is defined and mode is light.
statusReason: expected '#ff0000' to be '#cc0000' // Object.is equality

[Killed] ArithmeticOperator
utils/helpers/color/color.helpers.ts:42:5
 
   return rgbToHex(
     red * factor,
-    green * factor,
+    green / factor,
     blue * factor,
   );
killedBy: Color Helpers darkenHexColor should return '#010101' when darkening '#0a0a0a' by undefined
statusReason: expected '#01c801' to be '#010101' // Object.is equality

[Killed] ArithmeticOperator
utils/helpers/color/color.helpers.ts:43:5
   return rgbToHex(
     red * factor,
     green * factor,
-    blue * factor,
+    blue / factor,
   );
 }
killedBy: Color Helpers darkenHexColor should return '#010101' when darkening '#0a0a0a' by undefined
statusReason: expected '#0101c8' to be '#010101' // Object.is equality

[Killed] BlockStatement
utils/helpers/color/color.helpers.ts:47:63
   );
 }
 
-function lightenHexColor(hex: string, amount: number): string {
-  const { red, green, blue } = parseHexToRgb(hex);
-
-  return rgbToHex(
-    red + (MAX_RGB_VALUE - red) * amount,
-    green + (MAX_RGB_VALUE - green) * amount,
-    blue + (MAX_RGB_VALUE - blue) * amount,
-  );
-}
+function lightenHexColor(hex: string, amount: number): string {}
 
 export {
killedBy: useHexColor adaptedColor should return a lightened color when color is defined and mode is dark.
statusReason: expected undefined to be '#ff3333' // Object.is equality

[Killed] ArithmeticOperator
utils/helpers/color/color.helpers.ts:51:11
   const { red, green, blue } = parseHexToRgb(hex);
 
   return rgbToHex(
-    red + (MAX_RGB_VALUE - red) * amount,
+    red + (MAX_RGB_VALUE - red) / amount,
     green + (MAX_RGB_VALUE - green) * amount,
     blue + (MAX_RGB_VALUE - blue) * amount,
killedBy: Color Helpers lightenHexColor should return '#333333' when lightening '#000000' by undefined
statusReason: expected '#ff3333' to be '#333333' // Object.is equality

[Killed] ArithmeticOperator
utils/helpers/color/color.helpers.ts:51:12
   const { red, green, blue } = parseHexToRgb(hex);
 
   return rgbToHex(
-    red + (MAX_RGB_VALUE - red) * amount,
+    red + (MAX_RGB_VALUE + red) * amount,
     green + (MAX_RGB_VALUE - green) * amount,
     blue + (MAX_RGB_VALUE - blue) * amount,
killedBy: Color Helpers lightenHexColor should return '#fefefe' when lightening '#f0f0f0' by undefined
statusReason: expected '#fffefe' to be '#fefefe' // Object.is equality

[Killed] ArithmeticOperator
utils/helpers/color/color.helpers.ts:52:13
 
   return rgbToHex(
     red + (MAX_RGB_VALUE - red) * amount,
-    green + (MAX_RGB_VALUE - green) * amount,
+    green + (MAX_RGB_VALUE - green) / amount,
     blue + (MAX_RGB_VALUE - blue) * amount,
   );
killedBy: useHexColor adaptedColor should return a lightened color when color is defined and mode is dark.
statusReason: expected '#ffff33' to be '#ff3333' // Object.is equality

[Killed] ArithmeticOperator
utils/helpers/color/color.helpers.ts:52:14
 
   return rgbToHex(
     red + (MAX_RGB_VALUE - red) * amount,
-    green + (MAX_RGB_VALUE - green) * amount,
+    green + (MAX_RGB_VALUE + green) * amount,
     blue + (MAX_RGB_VALUE - blue) * amount,
   );
killedBy: Color Helpers lightenHexColor should return '#fefefe' when lightening '#f0f0f0' by undefined
statusReason: expected '#fefffe' to be '#fefefe' // Object.is equality

[Killed] ArithmeticOperator
utils/helpers/color/color.helpers.ts:53:12
   return rgbToHex(
     red + (MAX_RGB_VALUE - red) * amount,
     green + (MAX_RGB_VALUE - green) * amount,
-    blue + (MAX_RGB_VALUE - blue) * amount,
+    blue + (MAX_RGB_VALUE - blue) / amount,
   );
 }
killedBy: useHexColor adaptedColor should return a lightened color when color is defined and mode is dark.
statusReason: expected '#ff33ff' to be '#ff3333' // Object.is equality

[Killed] ArithmeticOperator
utils/helpers/color/color.helpers.ts:53:13
   return rgbToHex(
     red + (MAX_RGB_VALUE - red) * amount,
     green + (MAX_RGB_VALUE - green) * amount,
-    blue + (MAX_RGB_VALUE - blue) * amount,
+    blue + (MAX_RGB_VALUE + blue) * amount,
   );
 }
killedBy: Color Helpers lightenHexColor should return '#fefefe' when lightening '#f0f0f0' by undefined
statusReason: expected '#fefeff' to be '#fefefe' // Object.is equality
