[Killed] BooleanLiteral
utils/helpers/table/table.helpers.ts:5:67
 
 import type { CreateTableColumnOptions } from "~/utils/helpers/table/table.helpers.types";
 
-function createTableColumn<T>({ accessorKey, header, isCentered = false, tdClass }: CreateTableColumnOptions): TableColumn<T> {
+function createTableColumn<T>({ accessorKey, header, isCentered = true, tdClass }: CreateTableColumnOptions): TableColumn<T> {
   const tableColumn: TableColumn<T> = {
     accessorKey,
killedBy: Table Helpers createTableColumn should create a table column with accessorKey and empty header when called with only accessorKey.
statusReason: expected { accessorKey: 'name', …(2) } to strictly equal { accessorKey: 'name', header: '' }

[Killed] BlockStatement
utils/helpers/table/table.helpers.ts:5:127
 
 import type { CreateTableColumnOptions } from "~/utils/helpers/table/table.helpers.types";
 
-function createTableColumn<T>({ accessorKey, header, isCentered = false, tdClass }: CreateTableColumnOptions): TableColumn<T> {
-  const tableColumn: TableColumn<T> = {
-    accessorKey,
-    header: header ?? "",
-  };
-  const tdClasses = [isCentered ? "text-center" : undefined, tdClass].filter(Boolean).join(" ");
-
-  if (tdClasses) {
-    const metaClass: Record<string, string> = { td: tdClasses };
-
-    if (isCentered) {
-      metaClass.th = "text-center";
-    }
-    tableColumn.meta = { class: metaClass };
-  }
-  return tableColumn;
-}
+function createTableColumn<T>({ accessorKey, header, isCentered = false, tdClass }: CreateTableColumnOptions): TableColumn<T> {}
 
 export {
killedBy: Table Helpers createTableColumn should create a table column with accessorKey and empty header when called with only accessorKey.
statusReason: expected undefined to strictly equal { accessorKey: 'name', header: '' }

[Killed] LogicalOperator
utils/helpers/table/table.helpers.ts:8:13
 function createTableColumn<T>({ accessorKey, header, isCentered = false, tdClass }: CreateTableColumnOptions): TableColumn<T> {
   const tableColumn: TableColumn<T> = {
     accessorKey,
-    header: header ?? "",
+    header: header && "",
   };
   const tdClasses = [isCentered ? "text-center" : undefined, tdClass].filter(Boolean).join(" ");
killedBy: Table Helpers createTableColumn should create a table column with accessorKey and empty header when called with only accessorKey.
statusReason: expected { accessorKey: 'name', …(1) } to strictly equal { accessorKey: 'name', header: '' }

[Killed] MethodExpression
utils/helpers/table/table.helpers.ts:10:21
     accessorKey,
     header: header ?? "",
   };
-  const tdClasses = [isCentered ? "text-center" : undefined, tdClass].filter(Boolean).join(" ");
+  const tdClasses = [isCentered ? "text-center" : undefined, tdClass].join(" ");
 
   if (tdClasses) {
killedBy: Table Helpers createTableColumn should create a table column with accessorKey and empty header when called with only accessorKey.
statusReason: expected { accessorKey: 'name', …(2) } to strictly equal { accessorKey: 'name', header: '' }

[Killed] StringLiteral
utils/helpers/table/table.helpers.ts:10:92
     accessorKey,
     header: header ?? "",
   };
-  const tdClasses = [isCentered ? "text-center" : undefined, tdClass].filter(Boolean).join(" ");
+  const tdClasses = [isCentered ? "text-center" : undefined, tdClass].filter(Boolean).join("");
 
   if (tdClasses) {
killedBy: Table Helpers createTableColumn td class should create a table column with td class 'font-bold' when tdClass is provided.
statusReason: expected { accessorKey: 'name', …(2) } to strictly equal { accessorKey: 'name', …(2) }

[Killed] ConditionalExpression
utils/helpers/table/table.helpers.ts:12:7
   };
   const tdClasses = [isCentered ? "text-center" : undefined, tdClass].filter(Boolean).join(" ");
 
-  if (tdClasses) {
+  if (true) {
     const metaClass: Record<string, string> = { td: tdClasses };
 
killedBy: Table Helpers createTableColumn should create a table column with accessorKey and empty header when called with only accessorKey.
statusReason: expected { accessorKey: 'name', …(2) } to strictly equal { accessorKey: 'name', header: '' }

[Killed] BlockStatement
utils/helpers/table/table.helpers.ts:12:18
   };
   const tdClasses = [isCentered ? "text-center" : undefined, tdClass].filter(Boolean).join(" ");
 
-  if (tdClasses) {
-    const metaClass: Record<string, string> = { td: tdClasses };
-
-    if (isCentered) {
-      metaClass.th = "text-center";
-    }
-    tableColumn.meta = { class: metaClass };
-  }
+  if (tdClasses) {}
   return tableColumn;
 }
killedBy: Table Helpers createTableColumn should create a table column with centered meta when isCentered is true.
statusReason: expected { accessorKey: 'name', header: '' } to strictly equal { accessorKey: 'name', …(2) }

[Killed] ObjectLiteral
utils/helpers/table/table.helpers.ts:13:47
   const tdClasses = [isCentered ? "text-center" : undefined, tdClass].filter(Boolean).join(" ");
 
   if (tdClasses) {
-    const metaClass: Record<string, string> = { td: tdClasses };
+    const metaClass: Record<string, string> = {};
 
     if (isCentered) {
killedBy: Table Helpers createTableColumn should create a table column with centered meta when isCentered is true.
statusReason: expected { accessorKey: 'name', …(2) } to strictly equal { accessorKey: 'name', …(2) }

[Killed] ConditionalExpression
utils/helpers/table/table.helpers.ts:15:9
   if (tdClasses) {
     const metaClass: Record<string, string> = { td: tdClasses };
 
-    if (isCentered) {
+    if (true) {
       metaClass.th = "text-center";
     }
killedBy: Table Helpers createTableColumn td class should create a table column with td class 'whitespace-normal break-words' when tdClass is provided.
statusReason: expected { accessorKey: 'description', …(2) } to strictly equal { accessorKey: 'description', …(2) }

[Killed] BlockStatement
utils/helpers/table/table.helpers.ts:15:21
   if (tdClasses) {
     const metaClass: Record<string, string> = { td: tdClasses };
 
-    if (isCentered) {
-      metaClass.th = "text-center";
-    }
+    if (isCentered) {}
     tableColumn.meta = { class: metaClass };
   }
killedBy: Table Helpers createTableColumn should create a table column with centered meta when isCentered is true.
statusReason: expected { accessorKey: 'name', …(2) } to strictly equal { accessorKey: 'name', …(2) }

[Killed] StringLiteral
utils/helpers/table/table.helpers.ts:16:22
     const metaClass: Record<string, string> = { td: tdClasses };
 
     if (isCentered) {
-      metaClass.th = "text-center";
+      metaClass.th = "";
     }
     tableColumn.meta = { class: metaClass };
killedBy: Table Helpers createTableColumn should create a table column with centered meta when isCentered is true.
statusReason: expected { accessorKey: 'name', …(2) } to strictly equal { accessorKey: 'name', …(2) }
