[Killed] BlockStatement
utils/helpers/zod/zod.helpers.ts:3:74
 import type { ZodInternalCheck, ZodInternalObjectSchema, ZodInternalSchema } from "#shared/types/zod.types";
 
-function stripCheckRegexError(check: ZodInternalCheck): ZodInternalCheck {
-  if (check._zod.def.format !== "regex") {
-    return check;
-  }
-  const { error: _error, ...definitionWithoutError } = check._zod.def;
-
-  return { _zod: { ...check._zod, def: definitionWithoutError } };
-}
+function stripCheckRegexError(check: ZodInternalCheck): ZodInternalCheck {}
 
 function stripSchemaLevelRegexErrors(schema: ZodInternalSchema): ZodInternalSchema {
killedBy: Zod Helpers stripCheckRegexError should return the same check reference when the check format is not regex.
statusReason: expected undefined to be { _zod: { def: { …(2) } } } // Object.is equality

[Killed] ConditionalExpression
utils/helpers/zod/zod.helpers.ts:4:7
 import type { ZodInternalCheck, ZodInternalObjectSchema, ZodInternalSchema } from "#shared/types/zod.types";
 
 function stripCheckRegexError(check: ZodInternalCheck): ZodInternalCheck {
-  if (check._zod.def.format !== "regex") {
+  if (false) {
     return check;
   }
killedBy: Zod Helpers stripCheckRegexError should return the same check reference when the check format is not regex.
statusReason: expected { _zod: { def: { format: 'min' } } } to be { _zod: { def: { …(2) } } } // Object.is equality

[Killed] ConditionalExpression
utils/helpers/zod/zod.helpers.ts:4:7
 import type { ZodInternalCheck, ZodInternalObjectSchema, ZodInternalSchema } from "#shared/types/zod.types";
 
 function stripCheckRegexError(check: ZodInternalCheck): ZodInternalCheck {
-  if (check._zod.def.format !== "regex") {
+  if (true) {
     return check;
   }
killedBy: Zod Helpers stripCheckRegexError should return a different check reference when the check format is regex.
statusReason: expected { _zod: { def: { …(2) } } } not to be { _zod: { def: { …(2) } } } // Object.is equality

[Killed] ObjectLiteral
utils/helpers/zod/zod.helpers.ts:9:10
   }
   const { error: _error, ...definitionWithoutError } = check._zod.def;
 
-  return { _zod: { ...check._zod, def: definitionWithoutError } };
+  return {};
 }
 
killedBy: Zod Helpers stripCheckRegexError should return a new check with only the format property when the check format is regex.
statusReason: Cannot read properties of undefined (reading 'def')

[Killed] BlockStatement
utils/helpers/zod/zod.helpers.ts:12:84
   return { _zod: { ...check._zod, def: definitionWithoutError } };
 }
 
-function stripSchemaLevelRegexErrors(schema: ZodInternalSchema): ZodInternalSchema {
-  const { def } = schema._zod;
-
-  if (def.innerType) {
-    return { _zod: { ...schema._zod, def: { ...def, innerType: stripSchemaLevelRegexErrors(def.innerType) } } };
-  }
-
-  if (!def.checks) {
-    return schema;
-  }
-  return { _zod: { ...schema._zod, def: { ...def, checks: def.checks.map(stripCheckRegexError) } } };
-}
+function stripSchemaLevelRegexErrors(schema: ZodInternalSchema): ZodInternalSchema {}
 
 /**
killedBy: Zod Helpers stripSchemaLevelRegexErrors should return a new schema with the error property removed from the regex check when the schema has a regex check with a defined error.
statusReason: Schema is undefined

[Killed] ConditionalExpression
utils/helpers/zod/zod.helpers.ts:15:7
 function stripSchemaLevelRegexErrors(schema: ZodInternalSchema): ZodInternalSchema {
   const { def } = schema._zod;
 
-  if (def.innerType) {
+  if (true) {
     return { _zod: { ...schema._zod, def: { ...def, innerType: stripSchemaLevelRegexErrors(def.innerType) } } };
   }
killedBy: Zod Helpers stripSchemaLevelRegexErrors should return a different schema reference when the schema has a regex check with a defined error.
statusReason: Cannot read properties of undefined (reading '_zod')

[Killed] ConditionalExpression
utils/helpers/zod/zod.helpers.ts:15:7
 function stripSchemaLevelRegexErrors(schema: ZodInternalSchema): ZodInternalSchema {
   const { def } = schema._zod;
 
-  if (def.innerType) {
+  if (false) {
     return { _zod: { ...schema._zod, def: { ...def, innerType: stripSchemaLevelRegexErrors(def.innerType) } } };
   }
killedBy: Zod Helpers stripSchemaLevelRegexErrors should return a new schema with the error property removed from the inner type when the schema is optional with a regex check.
statusReason: expected { check: 'string_format', …(3) } to not have property "error"

[Killed] ObjectLiteral
utils/helpers/zod/zod.helpers.ts:16:20
   const { def } = schema._zod;
 
   if (def.innerType) {
-    return { _zod: { ...schema._zod, def: { ...def, innerType: stripSchemaLevelRegexErrors(def.innerType) } } };
+    return { _zod: {} };
   }
 
killedBy: Zod Helpers stripSchemaLevelRegexErrors should return a new schema with the error property removed from the inner type when the schema is optional with a regex check.
statusReason: Cannot read properties of undefined (reading 'innerType')

[Killed] ConditionalExpression
utils/helpers/zod/zod.helpers.ts:19:7
     return { _zod: { ...schema._zod, def: { ...def, innerType: stripSchemaLevelRegexErrors(def.innerType) } } };
   }
 
-  if (!def.checks) {
+  if (false) {
     return schema;
   }
killedBy: Zod Helpers stripSchemaLevelRegexErrors should return the same schema reference when the schema is a plain string with no checks defined.
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
utils/helpers/zod/zod.helpers.ts:19:7
     return { _zod: { ...schema._zod, def: { ...def, innerType: stripSchemaLevelRegexErrors(def.innerType) } } };
   }
 
-  if (!def.checks) {
+  if (true) {
     return schema;
   }
killedBy: Zod Helpers stripSchemaLevelRegexErrors should return a different schema reference when the schema has a regex check with a defined error.
statusReason: expected ZodString{ _zod: { …(11) }, …(48) } not to be ZodString{ _zod: { …(11) }, …(48) } // Object.is equality

[Killed] ObjectLiteral
utils/helpers/zod/zod.helpers.ts:22:41
   if (!def.checks) {
     return schema;
   }
-  return { _zod: { ...schema._zod, def: { ...def, checks: def.checks.map(stripCheckRegexError) } } };
+  return { _zod: { ...schema._zod, def: {} } };
 }
 
killedBy: Zod Helpers stripSchemaLevelRegexErrors should return a new schema with the error property removed from the regex check when the schema has a regex check with a defined error.
statusReason: No regex check found

[Killed] BlockStatement
utils/helpers/zod/zod.helpers.ts:36:93
  * @param schema - The Zod object schema to prepare.
  * @returns A new schema instance with regex error overrides removed from all field checks.
  */
-function prepareZodSchemaForFormValidation<T extends ZodInternalObjectSchema>(schema: T): T {
-  const { def } = schema._zod;
-  if (!def.shape) {
-    return schema;
-  }
-  const strippedShape = Object.fromEntries(Object.entries(def.shape).map(([key, fieldSchema]) => [key, stripSchemaLevelRegexErrors(fieldSchema)]));
-  const descriptors = Object.getOwnPropertyDescriptors(schema);
-  descriptors._zod = { value: { ...schema._zod, def: { ...def, shape: strippedShape } }, writable: false, enumerable: false, configurable: false };
-
-  // Acceptable as Object.create preserves the original Zod schema prototype and Standard Schema protocol
-  // oxlint-disable-next-line typescript/no-unsafe-type-assertion, typescript/no-unsafe-argument
-  return Object.create(Object.getPrototypeOf(schema), descriptors) as T;
-}
+function prepareZodSchemaForFormValidation<T extends ZodInternalObjectSchema>(schema: T): T {}
 
 export {
killedBy: Zod Helpers prepareZodSchemaForFormValidation should return a new schema with the error property removed from a regex check when the field has a hardcoded regex error.
statusReason: Cannot read properties of undefined (reading '_zod')

[Killed] BlockStatement
utils/helpers/zod/zod.helpers.ts:38:19
  */
 function prepareZodSchemaForFormValidation<T extends ZodInternalObjectSchema>(schema: T): T {
   const { def } = schema._zod;
-  if (!def.shape) {
-    return schema;
-  }
+  if (!def.shape) {}
   const strippedShape = Object.fromEntries(Object.entries(def.shape).map(([key, fieldSchema]) => [key, stripSchemaLevelRegexErrors(fieldSchema)]));
   const descriptors = Object.getOwnPropertyDescriptors(schema);
killedBy: Zod Helpers prepareZodSchemaForFormValidation should return the same schema reference when the schema has no shape property.
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
utils/helpers/zod/zod.helpers.ts:38:7
  */
 function prepareZodSchemaForFormValidation<T extends ZodInternalObjectSchema>(schema: T): T {
   const { def } = schema._zod;
-  if (!def.shape) {
+  if (false) {
     return schema;
   }
killedBy: Zod Helpers prepareZodSchemaForFormValidation should return the same schema reference when the schema has no shape property.
statusReason: Cannot convert undefined or null to object

[Killed] ArrowFunction
utils/helpers/zod/zod.helpers.ts:41:74
   if (!def.shape) {
     return schema;
   }
-  const strippedShape = Object.fromEntries(Object.entries(def.shape).map(([key, fieldSchema]) => [key, stripSchemaLevelRegexErrors(fieldSchema)]));
+  const strippedShape = Object.fromEntries(Object.entries(def.shape).map(() => undefined));
   const descriptors = Object.getOwnPropertyDescriptors(schema);
   descriptors._zod = { value: { ...schema._zod, def: { ...def, shape: strippedShape } }, writable: false, enumerable: false, configurable: false };
killedBy: Zod Helpers prepareZodSchemaForFormValidation should return a new schema with the error property removed from a regex check when the field has a hardcoded regex error.
statusReason: Iterator value undefined is not an entry object

[Killed] BooleanLiteral
utils/helpers/zod/zod.helpers.ts:43:140
   }
   const strippedShape = Object.fromEntries(Object.entries(def.shape).map(([key, fieldSchema]) => [key, stripSchemaLevelRegexErrors(fieldSchema)]));
   const descriptors = Object.getOwnPropertyDescriptors(schema);
-  descriptors._zod = { value: { ...schema._zod, def: { ...def, shape: strippedShape } }, writable: false, enumerable: false, configurable: false };
+  descriptors._zod = { value: { ...schema._zod, def: { ...def, shape: strippedShape } }, writable: false, enumerable: false, configurable: true };
 
   // Acceptable as Object.create preserves the original Zod schema prototype and Standard Schema protocol
killedBy: Zod Helpers prepareZodSchemaForFormValidation should return a schema whose _zod descriptor is not configurable when the field has a hardcoded regex error.
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
utils/helpers/zod/zod.helpers.ts:43:100
   }
   const strippedShape = Object.fromEntries(Object.entries(def.shape).map(([key, fieldSchema]) => [key, stripSchemaLevelRegexErrors(fieldSchema)]));
   const descriptors = Object.getOwnPropertyDescriptors(schema);
-  descriptors._zod = { value: { ...schema._zod, def: { ...def, shape: strippedShape } }, writable: false, enumerable: false, configurable: false };
+  descriptors._zod = { value: { ...schema._zod, def: { ...def, shape: strippedShape } }, writable: true, enumerable: false, configurable: false };
 
   // Acceptable as Object.create preserves the original Zod schema prototype and Standard Schema protocol
killedBy: Zod Helpers prepareZodSchemaForFormValidation should return a schema whose _zod descriptor is not writable when the field has a hardcoded regex error.
statusReason: expected true to be false // Object.is equality
