[Killed] BlockStatement
utils/goat-it-api/helpers/goat-it-api.helpers.ts:10:92
 import { HttpStatusCode } from "#server/utils/http/http.enums";
 import { isNonEmptyString } from "#shared/utils/helpers/string/string.helpers";
 
-function createGoatItApiEndpoint(resourceName: GoatItApiResourceName, id?: string): string {
-  const base = `/${GOAT_IT_API_ADMIN_SCOPE_NAME}/${resourceName}`;
-
-  return isNonEmptyString(id) ? `${base}/${id}` : base;
-}
+function createGoatItApiEndpoint(resourceName: GoatItApiResourceName, id?: string): string {}
 
 function createGoatItApiFetchOptions(goatItApiRuntimeConfig: SharedRuntimeConfig["goatItApi"]): Parameters<typeof $fetch>[1] {
killedBy: Goat It API Helpers createGoatItApiEndpoint should create the correct endpoint for a given resource name when called.
statusReason: expected undefined to be '/admin/question-themes' // Object.is equality

[Killed] BlockStatement
utils/goat-it-api/helpers/goat-it-api.helpers.ts:16:126
   return isNonEmptyString(id) ? `${base}/${id}` : base;
 }
 
-function createGoatItApiFetchOptions(goatItApiRuntimeConfig: SharedRuntimeConfig["goatItApi"]): Parameters<typeof $fetch>[1] {
-  return {
-    baseURL: goatItApiRuntimeConfig.baseUrl,
-    headers: {
-      "goat-it-api-key": goatItApiRuntimeConfig.adminKey,
-    },
-  };
-}
+function createGoatItApiFetchOptions(goatItApiRuntimeConfig: SharedRuntimeConfig["goatItApi"]): Parameters<typeof $fetch>[1] {}
 
 function handleGoatItApiError(error: unknown): never {
killedBy: Goat It API Helpers createGoatItApiFetchOptions should create the correct fetch options for a given Goat It API runtime config when called.
statusReason: expected undefined to strictly equal { …(2) }

[Killed] ObjectLiteral
utils/goat-it-api/helpers/goat-it-api.helpers.ts:17:10
 }
 
 function createGoatItApiFetchOptions(goatItApiRuntimeConfig: SharedRuntimeConfig["goatItApi"]): Parameters<typeof $fetch>[1] {
-  return {
-    baseURL: goatItApiRuntimeConfig.baseUrl,
-    headers: {
-      "goat-it-api-key": goatItApiRuntimeConfig.adminKey,
-    },
-  };
+  return {};
 }
 
killedBy: Goat It API Helpers createGoatItApiFetchOptions should create the correct fetch options for a given Goat It API runtime config when called.
statusReason: expected {} to strictly equal { …(2) }

[Killed] BlockStatement
utils/goat-it-api/helpers/goat-it-api.helpers.ts:26:39
 }
 
 function handleGoatItApiError(error: unknown): never {
-  if (!(error instanceof FetchError)) {
-    throw error;
-  }
+  if (!(error instanceof FetchError)) {}
 
   const parsedError = API_RESPONSE_EXCEPTION_DTO.safeParse(error.data);
killedBy: Goat It API Helpers handleGoatItApiError should re-throw the original error when error is not a FetchError.
statusReason: expected a thrown error to be Error: Some other error

[Killed] ConditionalExpression
utils/goat-it-api/helpers/goat-it-api.helpers.ts:32:7
 
   const parsedError = API_RESPONSE_EXCEPTION_DTO.safeParse(error.data);
 
-  if (!parsedError.success) {
+  if (false) {
     throw createError({
       statusCode: HttpStatusCode.INTERNAL_SERVER_ERROR,
killedBy: Goat It API Helpers handleGoatItApiError when error is a FetchError with invalid data that does not match ApiResponseExceptionDto should throw H3Error when called.
statusReason: expected error to be instance of H3Error

[Killed] BooleanLiteral
utils/goat-it-api/helpers/goat-it-api.helpers.ts:32:7
 
   const parsedError = API_RESPONSE_EXCEPTION_DTO.safeParse(error.data);
 
-  if (!parsedError.success) {
+  if (parsedError.success) {
     throw createError({
       statusCode: HttpStatusCode.INTERNAL_SERVER_ERROR,
killedBy: Goat It API Helpers handleGoatItApiError when error is a FetchError with valid ApiResponseExceptionDto data should throw H3Error with status code from the parsed API error when called.
statusReason: expected 500 to be 409 // Object.is equality

[Killed] ObjectLiteral
utils/goat-it-api/helpers/goat-it-api.helpers.ts:33:23
   const parsedError = API_RESPONSE_EXCEPTION_DTO.safeParse(error.data);
 
   if (!parsedError.success) {
-    throw createError({
-      statusCode: HttpStatusCode.INTERNAL_SERVER_ERROR,
-      message: "Internal server error",
-    });
+    throw createError({});
   }
 
killedBy: Goat It API Helpers handleGoatItApiError when error is a FetchError with invalid data that does not match ApiResponseExceptionDto should throw H3Error with internal server error message when called.
statusReason: expected [Function] to throw error including 'Internal server error' but got ''
