[Killed] BlockStatement
utils/goat-it-api/mappers/goat-it-api.mappers.ts:3:116
 import type { AdminQuestionThemeDto } from "@goat-it/schemas/question-theme";
 
-function createQuestionThemeFromAdminQuestionThemeDto(adminQuestionThemeDto: AdminQuestionThemeDto): QuestionTheme {
-  return {
-    id: adminQuestionThemeDto.id,
-    slug: adminQuestionThemeDto.slug,
-    color: adminQuestionThemeDto.color,
-    label: adminQuestionThemeDto.label,
-    aliases: adminQuestionThemeDto.aliases,
-    description: adminQuestionThemeDto.description,
-    status: adminQuestionThemeDto.status,
-    createdAt: new Date(adminQuestionThemeDto.createdAt),
-    updatedAt: new Date(adminQuestionThemeDto.updatedAt),
-  };
-}
+function createQuestionThemeFromAdminQuestionThemeDto(adminQuestionThemeDto: AdminQuestionThemeDto): QuestionTheme {}
 
 export {
killedBy: Question Mappers createQuestionFromAdminQuestionDto should create question from admin question dto with correct properties when called.
statusReason: expected { …(11) } to strictly equal { …(11) }
