[Killed] BlockStatement
mappers/question/question-author/question-author.mappers.ts:3:102
 import type { AdminQuestionAuthorDto, QuestionAuthor } from "#shared/types/question.types";
 
-function createQuestionAuthorFromAdminQuestionAuthorDto(dto: AdminQuestionAuthorDto): QuestionAuthor {
-  return { ...dto };
-}
+function createQuestionAuthorFromAdminQuestionAuthorDto(dto: AdminQuestionAuthorDto): QuestionAuthor {}
 
 export {
killedBy: Question Mappers createQuestionFromAdminQuestionDto should create question from admin question dto with correct properties when called.
statusReason: expected { …(11) } to strictly equal { …(11) }

[Killed] ObjectLiteral
mappers/question/question-author/question-author.mappers.ts:4:10
 import type { AdminQuestionAuthorDto, QuestionAuthor } from "#shared/types/question.types";
 
 function createQuestionAuthorFromAdminQuestionAuthorDto(dto: AdminQuestionAuthorDto): QuestionAuthor {
-  return { ...dto };
+  return {};
 }
 
killedBy: Question Mappers createQuestionFromAdminQuestionDto should create question from admin question dto with correct properties when called.
statusReason: expected { …(11) } to strictly equal { …(11) }
