[Killed] BlockStatement
mappers/question/question-content/question-content.mappers.ts:3:106
 import type { AdminQuestionContentDto, QuestionContent } from "#shared/types/question.types";
 
-function createQuestionContentFromAdminQuestionContentDto(dto: AdminQuestionContentDto): QuestionContent {
-  return { ...dto };
-}
+function createQuestionContentFromAdminQuestionContentDto(dto: AdminQuestionContentDto): QuestionContent {}
 
 export {
killedBy: Question Mappers createQuestionFromAdminQuestionDto should create question from admin question dto with correct properties when called.
statusReason: expected { …(11) } to strictly equal { …(11) }
