[Killed] BlockStatement
mappers/question/question-rejection/question-rejection.mappers.ts:3:114
 import type { AdminQuestionRejectionDto, QuestionRejection } from "#shared/types/question.types";
 
-function createQuestionRejectionFromAdminQuestionRejectionDto(dto: AdminQuestionRejectionDto): QuestionRejection {
-  return { ...dto };
-}
+function createQuestionRejectionFromAdminQuestionRejectionDto(dto: AdminQuestionRejectionDto): QuestionRejection {}
 
 export {
killedBy: Question Mappers createQuestionFromAdminQuestionDto should map rejection when dto has a rejection.
statusReason: expected undefined to strictly equal { type: 'other', …(1) }
