[Killed] BlockStatement
mappers/question/question-theme-assignment/question-theme-assignment.mappers.ts:4:138
 import type { AdminQuestionThemeAssignmentDto, QuestionThemeAssignment } from "#shared/types/question.types";
 import { createQuestionThemeFromAdminQuestionThemeDto } from "#server/utils/goat-it-api/mappers/goat-it-api.mappers";
 
-function createQuestionThemeAssignmentFromAdminQuestionThemeAssignmentDto(dto: AdminQuestionThemeAssignmentDto): QuestionThemeAssignment {
-  return {
-    theme: createQuestionThemeFromAdminQuestionThemeDto(dto.theme),
-    isPrimary: dto.isPrimary,
-    isHint: dto.isHint,
-  };
-}
+function createQuestionThemeAssignmentFromAdminQuestionThemeAssignmentDto(dto: AdminQuestionThemeAssignmentDto): QuestionThemeAssignment {}
 
 export {
killedBy: Question Mappers createQuestionFromAdminQuestionDto should create question from admin question dto with correct properties when called.
statusReason: expected { …(11) } to strictly equal { …(11) }
