[Killed] BlockStatement
goat-it-api/mappers/question/question.mappers.ts:9:78
 import { createQuestionAuthorFromAdminQuestionAuthorDto } from "#server/utils/goat-it-api/mappers/question/question-author/question-author.mappers";
 import { createQuestionRejectionFromAdminQuestionRejectionDto } from "#server/utils/goat-it-api/mappers/question/question-rejection/question-rejection.mappers";
 
-function createQuestionFromAdminQuestionDto(dto: AdminQuestionDto): Question {
-  return {
-    id: dto.id,
-    category: dto.category,
-    themes: dto.themes.map(createQuestionThemeAssignmentFromAdminQuestionThemeAssignmentDto),
-    content: createQuestionContentFromAdminQuestionContentDto(dto.content),
-    cognitiveDifficulty: dto.cognitiveDifficulty,
-    author: createQuestionAuthorFromAdminQuestionAuthorDto(dto.author),
-    status: dto.status,
-    rejection: dto.rejection ? createQuestionRejectionFromAdminQuestionRejectionDto(dto.rejection) : undefined,
-    sourceUrls: dto.sourceUrls,
-    createdAt: new Date(dto.createdAt),
-    updatedAt: new Date(dto.updatedAt),
-  };
-}
+function createQuestionFromAdminQuestionDto(dto: AdminQuestionDto): Question {}
 
 export {
killedBy: Question Mappers createQuestionFromAdminQuestionDto should create question from admin question dto with correct properties when called.
statusReason: expected undefined to strictly equal { …(11) }
