[Killed] BlockStatement
server/utils/router/router.helpers.ts:7:106
 import { isNonEmptyString } from "#shared/utils/helpers/string/string.helpers";
 import { HttpStatusCode } from "#server/utils/http/http.enums";
 
-function getRequiredRouterParameter(event: H3Event, parameterName: string, errorMessage: string): string {
-  const value = getRouterParam(event, parameterName);
-
-  if (!isNonEmptyString(value)) {
-    throw createError({
-      statusCode: HttpStatusCode.BAD_REQUEST,
-      message: errorMessage,
-    });
-  }
-  return value;
-}
+function getRequiredRouterParameter(event: H3Event, parameterName: string, errorMessage: string): string {}
 
 export {
killedBy: Server Router Helpers getRequiredRouterParameter should call getRouterParam with event and param name when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ { context: { params: {} } }, 'id' ]

Number of calls: 0

[Killed] BlockStatement
server/utils/router/router.helpers.ts:10:33
 function getRequiredRouterParameter(event: H3Event, parameterName: string, errorMessage: string): string {
   const value = getRouterParam(event, parameterName);
 
-  if (!isNonEmptyString(value)) {
-    throw createError({
-      statusCode: HttpStatusCode.BAD_REQUEST,
-      message: errorMessage,
-    });
-  }
+  if (!isNonEmptyString(value)) {}
   return value;
 }
killedBy: Server Router Helpers getRequiredRouterParameter should throw a 400 error when router param is undefined
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
server/utils/router/router.helpers.ts:10:7
 function getRequiredRouterParameter(event: H3Event, parameterName: string, errorMessage: string): string {
   const value = getRouterParam(event, parameterName);
 
-  if (!isNonEmptyString(value)) {
+  if (false) {
     throw createError({
       statusCode: HttpStatusCode.BAD_REQUEST,
killedBy: Server Router Helpers getRequiredRouterParameter should throw a 400 error when router param is undefined
statusReason: expected [Function] to throw an error
