[Killed] BlockStatement
utils/helpers/array/array.helpers.ts:10:109
  * @param {T} replacement - The value to substitute in.
  * @return {T[]} A new array with the replacement applied, or a shallow copy if no match was found.
  */
-function replaceInArrayById<T extends { id: string }>(array: readonly T[], id: string, replacement: T): T[] {
-  const index = array.findIndex(item => item.id === id);
-  if (index === -1) {
-    return [...array];
-  }
-  return array.toSpliced(index, 1, replacement);
-}
+function replaceInArrayById<T extends { id: string }>(array: readonly T[], id: string, replacement: T): T[] {}
 
 export {
killedBy: replaceInArrayById should return a new array with the matching element replaced when an element with the given id exists.
statusReason: expected undefined to strictly equal [ { id: '1', name: 'a' }, …(2) ]

[Killed] EqualityOperator
utils/helpers/array/array.helpers.ts:11:41
  * @return {T[]} A new array with the replacement applied, or a shallow copy if no match was found.
  */
 function replaceInArrayById<T extends { id: string }>(array: readonly T[], id: string, replacement: T): T[] {
-  const index = array.findIndex(item => item.id === id);
+  const index = array.findIndex(item => item.id !== id);
   if (index === -1) {
     return [...array];
killedBy: replaceInArrayById should return a new array with the matching element replaced when an element with the given id exists.
statusReason: expected [ { id: '2', name: 'replaced' }, …(2) ] to strictly equal [ { id: '1', name: 'a' }, …(2) ]

[Killed] ArrowFunction
utils/helpers/array/array.helpers.ts:11:33
  * @return {T[]} A new array with the replacement applied, or a shallow copy if no match was found.
  */
 function replaceInArrayById<T extends { id: string }>(array: readonly T[], id: string, replacement: T): T[] {
-  const index = array.findIndex(item => item.id === id);
+  const index = array.findIndex(() => undefined);
   if (index === -1) {
     return [...array];
killedBy: replaceInArrayById should return a new array with the matching element replaced when an element with the given id exists.
statusReason: expected [ { id: '1', name: 'a' }, …(2) ] to strictly equal [ { id: '1', name: 'a' }, …(2) ]

[Killed] ConditionalExpression
utils/helpers/array/array.helpers.ts:12:7
  */
 function replaceInArrayById<T extends { id: string }>(array: readonly T[], id: string, replacement: T): T[] {
   const index = array.findIndex(item => item.id === id);
-  if (index === -1) {
+  if (true) {
     return [...array];
   }
killedBy: replaceInArrayById should return a new array with the matching element replaced when an element with the given id exists.
statusReason: expected [ { id: '1', name: 'a' }, …(2) ] to strictly equal [ { id: '1', name: 'a' }, …(2) ]

[Killed] ConditionalExpression
utils/helpers/array/array.helpers.ts:12:7
  */
 function replaceInArrayById<T extends { id: string }>(array: readonly T[], id: string, replacement: T): T[] {
   const index = array.findIndex(item => item.id === id);
-  if (index === -1) {
+  if (false) {
     return [...array];
   }
killedBy: replaceInArrayById should return a copy of the original array when no element matches the given id.
statusReason: expected [ { id: '1', name: 'a' }, …(1) ] to strictly equal [ { id: '1', name: 'a' }, …(1) ]
