[Killed] BlockStatement
utils/helpers/localization/localization.helpers.ts:5:116
 
 import { isNonEmptyString } from "#shared/utils/helpers/string/string.helpers";
 
-function isLocalizedValueMissing(field: Partial<LocalizedText> | Partial<LocalizedTexts>, locale: Locale): boolean {
-  const value = field[locale];
-
-  if (Array.isArray(value)) {
-    return value.map(item => item.trim()).filter(Boolean).length === 0;
-  }
-  return !isNonEmptyString(value?.trim());
-}
+function isLocalizedValueMissing(field: Partial<LocalizedText> | Partial<LocalizedTexts>, locale: Locale): boolean {}
 
 function getLocalizedDisplayValue(field: Partial<LocalizedText>, locale: Locale): string | undefined {
killedBy: useLocalizedValue Composable isCurrentLocaleMissing should return true when current locale value is undefined.
statusReason: expected undefined to be truthy

[Killed] BlockStatement
utils/helpers/localization/localization.helpers.ts:8:29
 function isLocalizedValueMissing(field: Partial<LocalizedText> | Partial<LocalizedTexts>, locale: Locale): boolean {
   const value = field[locale];
 
-  if (Array.isArray(value)) {
-    return value.map(item => item.trim()).filter(Boolean).length === 0;
-  }
+  if (Array.isArray(value)) {}
   return !isNonEmptyString(value?.trim());
 }
killedBy: Localization Helpers isLocalizedValueMissing should return true when undefined
statusReason: value?.trim is not a function

[Killed] MethodExpression
utils/helpers/localization/localization.helpers.ts:9:30
   const value = field[locale];
 
   if (Array.isArray(value)) {
-    return value.map(item => item.trim()).filter(Boolean).length === 0;
+    return value.map(item => item).filter(Boolean).length === 0;
   }
   return !isNonEmptyString(value?.trim());
killedBy: Localization Helpers isLocalizedValueMissing should return true when undefined
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
utils/helpers/localization/localization.helpers.ts:9:12
   const value = field[locale];
 
   if (Array.isArray(value)) {
-    return value.map(item => item.trim()).filter(Boolean).length === 0;
+    return true;
   }
   return !isNonEmptyString(value?.trim());
killedBy: Localization Helpers isLocalizedValueMissing should return false when undefined
statusReason: expected true to be false // Object.is equality

[Killed] OptionalChaining
utils/helpers/localization/localization.helpers.ts:11:28
   if (Array.isArray(value)) {
     return value.map(item => item.trim()).filter(Boolean).length === 0;
   }
-  return !isNonEmptyString(value?.trim());
+  return !isNonEmptyString(value.trim());
 }
 
killedBy: useLocalizedValue Composable isCurrentLocaleMissing should return true when current locale value is undefined.
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] BooleanLiteral
utils/helpers/localization/localization.helpers.ts:11:10
   if (Array.isArray(value)) {
     return value.map(item => item.trim()).filter(Boolean).length === 0;
   }
-  return !isNonEmptyString(value?.trim());
+  return isNonEmptyString(value?.trim());
 }
 
killedBy: useTranslationCompleteness completedCount should return 6 when all locales have non-empty values in all fields.
statusReason: expected +0 to be 6 // Object.is equality

[Killed] BlockStatement
utils/helpers/localization/localization.helpers.ts:14:102
   return !isNonEmptyString(value?.trim());
 }
 
-function getLocalizedDisplayValue(field: Partial<LocalizedText>, locale: Locale): string | undefined {
-  const value = field[locale]?.trim();
-
-  if (!isNonEmptyString(value)) {
-    return undefined;
-  }
-  return value;
-}
+function getLocalizedDisplayValue(field: Partial<LocalizedText>, locale: Locale): string | undefined {}
 
 function getLocalizedTextsDisplayValue(field: Partial<LocalizedTexts>, locale: Locale): string | undefined {
killedBy: useLocalizedValue Composable currentLocaleDisplayValue should return trimmed string when current locale value is available.
statusReason: expected undefined to be 'Hello' // Object.is equality

[Killed] OptionalChaining
utils/helpers/localization/localization.helpers.ts:15:17
 }
 
 function getLocalizedDisplayValue(field: Partial<LocalizedText>, locale: Locale): string | undefined {
-  const value = field[locale]?.trim();
+  const value = field[locale].trim();
 
   if (!isNonEmptyString(value)) {
killedBy: useLocalizedValue Composable currentLocaleDisplayValue should return undefined when current locale value is missing.
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] MethodExpression
utils/helpers/localization/localization.helpers.ts:15:17
 }
 
 function getLocalizedDisplayValue(field: Partial<LocalizedText>, locale: Locale): string | undefined {
-  const value = field[locale]?.trim();
+  const value = field[locale];
 
   if (!isNonEmptyString(value)) {
killedBy: useLocalizedValue Composable currentLocaleDisplayValue should return trimmed string when current locale value is available.
statusReason: expected '  Hello  ' to be 'Hello' // Object.is equality

[Killed] BlockStatement
utils/helpers/localization/localization.helpers.ts:17:33
 function getLocalizedDisplayValue(field: Partial<LocalizedText>, locale: Locale): string | undefined {
   const value = field[locale]?.trim();
 
-  if (!isNonEmptyString(value)) {
-    return undefined;
-  }
+  if (!isNonEmptyString(value)) {}
   return value;
 }
killedBy: useLocalizedValue Composable currentLocaleDisplayValue should return undefined when current locale value is empty string.
statusReason: expected '' to be undefined

[Killed] BlockStatement
utils/helpers/localization/localization.helpers.ts:23:108
   return value;
 }
 
-function getLocalizedTextsDisplayValue(field: Partial<LocalizedTexts>, locale: Locale): string | undefined {
-  const values = field[locale];
-
-  if (!values) {
-    return undefined;
-  }
-  const trimmedValues = values.map(value => value.trim()).filter(Boolean);
-
-  if (trimmedValues.length === 0) {
-    return undefined;
-  }
-  return trimmedValues.join(", ");
-}
+function getLocalizedTextsDisplayValue(field: Partial<LocalizedTexts>, locale: Locale): string | undefined {}
 
 export { isLocalizedValueMissing, getLocalizedDisplayValue, getLocalizedTextsDisplayValue };
killedBy: Localization Helpers getLocalizedTextsDisplayValue should return 'physics, chemistry, biology' when undefined
statusReason: expected undefined to be 'physics, chemistry, biology' // Object.is equality

[Killed] BlockStatement
utils/helpers/localization/localization.helpers.ts:26:16
 function getLocalizedTextsDisplayValue(field: Partial<LocalizedTexts>, locale: Locale): string | undefined {
   const values = field[locale];
 
-  if (!values) {
-    return undefined;
-  }
+  if (!values) {}
   const trimmedValues = values.map(value => value.trim()).filter(Boolean);
 
killedBy: Localization Helpers getLocalizedTextsDisplayValue should return undefined when undefined
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BooleanLiteral
utils/helpers/localization/localization.helpers.ts:26:7
 function getLocalizedTextsDisplayValue(field: Partial<LocalizedTexts>, locale: Locale): string | undefined {
   const values = field[locale];
 
-  if (!values) {
+  if (values) {
     return undefined;
   }
killedBy: Localization Helpers getLocalizedTextsDisplayValue should return 'physics, chemistry, biology' when undefined
statusReason: expected undefined to be 'physics, chemistry, biology' // Object.is equality

[Killed] MethodExpression
utils/helpers/localization/localization.helpers.ts:29:25
   if (!values) {
     return undefined;
   }
-  const trimmedValues = values.map(value => value.trim()).filter(Boolean);
+  const trimmedValues = values.map(value => value.trim());
 
   if (trimmedValues.length === 0) {
killedBy: Localization Helpers getLocalizedTextsDisplayValue should return 'physics, biology' when undefined
statusReason: expected 'physics, , biology' to be 'physics, biology' // Object.is equality

[Killed] ArrowFunction
utils/helpers/localization/localization.helpers.ts:29:36
   if (!values) {
     return undefined;
   }
-  const trimmedValues = values.map(value => value.trim()).filter(Boolean);
+  const trimmedValues = values.map(() => undefined).filter(Boolean);
 
   if (trimmedValues.length === 0) {
killedBy: Localization Helpers getLocalizedTextsDisplayValue should return 'physics, chemistry, biology' when undefined
statusReason: expected undefined to be 'physics, chemistry, biology' // Object.is equality

[Killed] ConditionalExpression
utils/helpers/localization/localization.helpers.ts:31:7
   }
   const trimmedValues = values.map(value => value.trim()).filter(Boolean);
 
-  if (trimmedValues.length === 0) {
+  if (false) {
     return undefined;
   }
killedBy: Localization Helpers getLocalizedTextsDisplayValue should return undefined when undefined
statusReason: expected '' to be undefined

[Killed] EqualityOperator
utils/helpers/localization/localization.helpers.ts:31:7
   }
   const trimmedValues = values.map(value => value.trim()).filter(Boolean);
 
-  if (trimmedValues.length === 0) {
+  if (trimmedValues.length !== 0) {
     return undefined;
   }
killedBy: Localization Helpers getLocalizedTextsDisplayValue should return 'physics, chemistry, biology' when undefined
statusReason: expected undefined to be 'physics, chemistry, biology' // Object.is equality
