[Killed] BlockStatement
utils/helpers/object/object.helpers.ts:3:69
 import { dash } from "radashi";
 
-function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value) && Object.getPrototypeOf(value) === Object.prototype;
-}
+function isRecord(value: unknown): value is Record<string, unknown> {}
 
 function isEmptyRecord(value: unknown): boolean {
killedBy: useGoatItApiErrorToast extractErrorCode should return the error code when error is a FetchError with a valid string errorCode.
statusReason: expected undefined to be 'someErrorCode' // Object.is equality

[Killed] EqualityOperator
utils/helpers/object/object.helpers.ts:4:10
 import { dash } from "radashi";
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value) && Object.getPrototypeOf(value) === Object.prototype;
+  return typeof value !== "object" && value !== null && !Array.isArray(value) && Object.getPrototypeOf(value) === Object.prototype;
 }
 
killedBy: useGoatItApiErrorToast extractErrorCode should return the error code when error is a FetchError with a valid string errorCode.
statusReason: expected undefined to be 'someErrorCode' // Object.is equality

[Killed] EqualityOperator
utils/helpers/object/object.helpers.ts:4:82
 import { dash } from "radashi";
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value) && Object.getPrototypeOf(value) === Object.prototype;
+  return typeof value === "object" && value !== null && !Array.isArray(value) && Object.getPrototypeOf(value) !== Object.prototype;
 }
 
killedBy: useGoatItApiErrorToast extractErrorCode should return the error code when error is a FetchError with a valid string errorCode.
statusReason: expected undefined to be 'someErrorCode' // Object.is equality

[Killed] BlockStatement
utils/helpers/object/object.helpers.ts:7:49
   return typeof value === "object" && value !== null && !Array.isArray(value) && Object.getPrototypeOf(value) === Object.prototype;
 }
 
-function isEmptyRecord(value: unknown): boolean {
-  if (!isRecord(value)) {
-    return false;
-  }
-  return Object.values(value).every(entry => entry === undefined);
-}
+function isEmptyRecord(value: unknown): boolean {}
 
 function stripEmptyValues<T>(input: T): T {
killedBy: Object Helpers isEmptyRecord should return true when value is undefined
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
utils/helpers/object/object.helpers.ts:8:7
 }
 
 function isEmptyRecord(value: unknown): boolean {
-  if (!isRecord(value)) {
+  if (false) {
     return false;
   }
killedBy: Object Helpers isEmptyRecord should return false when value is undefined
statusReason: Cannot convert undefined or null to object

[Killed] BooleanLiteral
utils/helpers/object/object.helpers.ts:8:7
 }
 
 function isEmptyRecord(value: unknown): boolean {
-  if (!isRecord(value)) {
+  if (isRecord(value)) {
     return false;
   }
killedBy: Object Helpers isEmptyRecord should return true when value is undefined
statusReason: expected false to be truthy

[Killed] BooleanLiteral
utils/helpers/object/object.helpers.ts:9:12
 
 function isEmptyRecord(value: unknown): boolean {
   if (!isRecord(value)) {
-    return false;
+    return true;
   }
   return Object.values(value).every(entry => entry === undefined);
killedBy: Object Helpers isEmptyRecord should return false when value is undefined
statusReason: expected true to be falsy

[Killed] MethodExpression
utils/helpers/object/object.helpers.ts:11:10
   if (!isRecord(value)) {
     return false;
   }
-  return Object.values(value).every(entry => entry === undefined);
+  return Object.values(value).some(entry => entry === undefined);
 }
 
killedBy: Object Helpers isEmptyRecord should return true when value is undefined
statusReason: expected false to be truthy

[Killed] ConditionalExpression
utils/helpers/object/object.helpers.ts:11:46
   if (!isRecord(value)) {
     return false;
   }
-  return Object.values(value).every(entry => entry === undefined);
+  return Object.values(value).every(entry => true);
 }
 
killedBy: Object Helpers isEmptyRecord should return false when value is undefined
statusReason: expected true to be falsy

[Killed] BlockStatement
utils/helpers/object/object.helpers.ts:14:43
   return Object.values(value).every(entry => entry === undefined);
 }
 
-function stripEmptyValues<T>(input: T): T {
-  if (!isRecord(input)) {
-    return input;
-  }
-  const result = Object.fromEntries(Object.entries(input).map(([key, value]) => {
-    if (!isRecord(value)) {
-      return [key, value];
-    }
-    const cleaned = stripEmptyValues(value);
-
-    if (Object.values(cleaned).every(entry => entry === undefined)) {
-      return [key, undefined];
-    }
-    return [key, cleaned];
-  }));
-
-  // Acceptable as the result is structurally identical to the input type
-  // oxlint-disable-next-line typescript/no-unsafe-type-assertion
-  return result as T;
-}
+function stripEmptyValues<T>(input: T): T {}
 
 function toKebabCaseKeys(object: Record<string, unknown>): Record<string, unknown> {
killedBy: Object Helpers stripEmptyValues should return the input unchanged when it is undefined
statusReason: expected undefined to strictly equal 'hello'

[Killed] ConditionalExpression
utils/helpers/object/object.helpers.ts:15:7
 }
 
 function stripEmptyValues<T>(input: T): T {
-  if (!isRecord(input)) {
+  if (true) {
     return input;
   }
killedBy: Object Helpers stripEmptyValues should set nested object to undefined when all its values are undefined.
statusReason: expected { name: 'hello', nested: { …(2) } } to strictly equal { name: 'hello', nested: undefined }

[Killed] BlockStatement
utils/helpers/object/object.helpers.ts:15:25
 }
 
 function stripEmptyValues<T>(input: T): T {
-  if (!isRecord(input)) {
-    return input;
-  }
+  if (!isRecord(input)) {}
   const result = Object.fromEntries(Object.entries(input).map(([key, value]) => {
     if (!isRecord(value)) {
killedBy: Object Helpers stripEmptyValues should return the input unchanged when it is undefined
statusReason: expected { '0': 'h', '1': 'e', '2': 'l', …(2) } to strictly equal 'hello'

[Killed] BlockStatement
utils/helpers/object/object.helpers.ts:18:81
   if (!isRecord(input)) {
     return input;
   }
-  const result = Object.fromEntries(Object.entries(input).map(([key, value]) => {
-    if (!isRecord(value)) {
-      return [key, value];
-    }
-    const cleaned = stripEmptyValues(value);
-
-    if (Object.values(cleaned).every(entry => entry === undefined)) {
-      return [key, undefined];
-    }
-    return [key, cleaned];
-  }));
+  const result = Object.fromEntries(Object.entries(input).map(([key, value]) => {}));
 
   // Acceptable as the result is structurally identical to the input type
killedBy: Object Helpers stripEmptyValues should return the same structure when no values are empty records.
statusReason: Iterator value undefined is not an entry object

[Killed] BlockStatement
utils/helpers/object/object.helpers.ts:19:27
     return input;
   }
   const result = Object.fromEntries(Object.entries(input).map(([key, value]) => {
-    if (!isRecord(value)) {
-      return [key, value];
-    }
+    if (!isRecord(value)) {}
     const cleaned = stripEmptyValues(value);
 
killedBy: Object Helpers stripEmptyValues should return the same structure when no values are empty records.
statusReason: expected { name: 'hello', count: undefined } to strictly equal { name: 'hello', count: 42 }

[Killed] ConditionalExpression
utils/helpers/object/object.helpers.ts:19:9
     return input;
   }
   const result = Object.fromEntries(Object.entries(input).map(([key, value]) => {
-    if (!isRecord(value)) {
+    if (true) {
       return [key, value];
     }
killedBy: Object Helpers stripEmptyValues should set nested object to undefined when all its values are undefined.
statusReason: expected { name: 'hello', nested: { …(2) } } to strictly equal { name: 'hello', nested: undefined }

[Killed] ArrayDeclaration
utils/helpers/object/object.helpers.ts:20:14
   }
   const result = Object.fromEntries(Object.entries(input).map(([key, value]) => {
     if (!isRecord(value)) {
-      return [key, value];
+      return [];
     }
     const cleaned = stripEmptyValues(value);
killedBy: Object Helpers stripEmptyValues should return the same structure when no values are empty records.
statusReason: expected { undefined: undefined } to strictly equal { name: 'hello', count: 42 }

[Killed] ConditionalExpression
utils/helpers/object/object.helpers.ts:24:47
     }
     const cleaned = stripEmptyValues(value);
 
-    if (Object.values(cleaned).every(entry => entry === undefined)) {
+    if (Object.values(cleaned).every(entry => true)) {
       return [key, undefined];
     }
killedBy: Object Helpers stripEmptyValues should preserve nested object when at least one value is defined.
statusReason: expected { name: 'hello', nested: undefined } to strictly equal { name: 'hello', nested: { …(2) } }

[Killed] ArrowFunction
utils/helpers/object/object.helpers.ts:24:38
     }
     const cleaned = stripEmptyValues(value);
 
-    if (Object.values(cleaned).every(entry => entry === undefined)) {
+    if (Object.values(cleaned).every(() => undefined)) {
       return [key, undefined];
     }
killedBy: Object Helpers stripEmptyValues should set nested object to undefined when all its values are undefined.
statusReason: expected { name: 'hello', nested: { …(2) } } to strictly equal { name: 'hello', nested: undefined }

[Killed] ArrayDeclaration
utils/helpers/object/object.helpers.ts:27:12
     if (Object.values(cleaned).every(entry => entry === undefined)) {
       return [key, undefined];
     }
-    return [key, cleaned];
+    return [];
   }));
 
killedBy: Object Helpers stripEmptyValues should preserve nested object when at least one value is defined.
statusReason: expected { name: 'hello', undefined: undefined } to strictly equal { name: 'hello', nested: { …(2) } }

[Killed] BlockStatement
utils/helpers/object/object.helpers.ts:35:84
   return result as T;
 }
 
-function toKebabCaseKeys(object: Record<string, unknown>): Record<string, unknown> {
-  const entries = Object.entries(object).map(([key, value]: [string, unknown]): [string, unknown] => [dash(key), value]);
-
-  // Acceptable as Object.fromEntries returns a plain object with kebab-case keys
-  // oxlint-disable-next-line typescript/no-unsafe-type-assertion
-  return Object.fromEntries(entries) as Record<string, unknown>;
-}
+function toKebabCaseKeys(object: Record<string, unknown>): Record<string, unknown> {}
 
 export {
killedBy: Object Helpers toKebabCaseKeys should convert keys correctly when undefined
statusReason: expected undefined to strictly equal { Object (cognitive-difficulty, some-key) }

[Killed] ArrowFunction
utils/helpers/object/object.helpers.ts:36:46
 }
 
 function toKebabCaseKeys(object: Record<string, unknown>): Record<string, unknown> {
-  const entries = Object.entries(object).map(([key, value]: [string, unknown]): [string, unknown] => [dash(key), value]);
+  const entries = Object.entries(object).map(() => undefined);
 
   // Acceptable as Object.fromEntries returns a plain object with kebab-case keys
killedBy: Object Helpers toKebabCaseKeys should convert keys correctly when undefined
statusReason: Iterator value undefined is not an entry object
