[Killed] BlockStatement
utils/helpers/time/time.helpers.ts:7:49
  * @param {number} ms - The number of milliseconds to wait.
  * @return {Promise<void>} A promise that resolves after the delay.
  */
-async function sleep(ms: number): Promise<void> {
-  return new Promise<void>(resolve => {
-    setTimeout(resolve, ms);
-  });
-}
+async function sleep(ms: number): Promise<void> {}
 
 export {
killedBy: sleep should call setTimeout with the specified delay when called.
statusReason: expected "setTimeout" to be called once with arguments: [ Any<Function>, 500 ]

Number of calls: 0
